betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
#define SMC_WRTTIM2_ASYNCACCCFG_Pos                                 (28U)
#define SMC_WRTTIM2_ASYNCACCCFG_Msk                                 (0x3UL << SMC_WRTTIM2_ASYNCACCCFG_Pos)                         /*!< 0x30000000 */
#define SMC_WRTTIM2_ASYNCACCCFG                                     SMC_WRTTIM2_ASYNCACCCFG_Msk                                    /*!<ACCMOD[1:0] bits (Access mode) */
#define SMC_WRTTIM2_ASYNCACCCFG_0                                   (0x1UL << SMC_WRTTIM2_ASYNCACCCFG_Pos)                         /*!< 0x10000000 */
#define SMC_WRTTIM2_ASYNCACCCFG_1                                   (0x2UL << SMC_WRTTIM2_ASYNCACCCFG_Pos)                         /*!< 0x20000000 */

/******************  Bit definition for SMC_WRTTIM3 register  ******************/
#define SMC_WRTTIM3_ADDRSETCFG_Pos                                  (0U)
#define SMC_WRTTIM3_ADDRSETCFG_Msk                                  (0xFUL << SMC_WRTTIM3_ADDRSETCFG_Pos)                          /*!< 0x0000000F */
#define SMC_WRTTIM3_ADDRSETCFG                                      SMC_WRTTIM3_ADDRSETCFG_Msk                                     /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define SMC_WRTTIM3_ADDRSETCFG_0                                    (0x1UL << SMC_WRTTIM3_ADDRSETCFG_Pos)                          /*!< 0x00000001 */
#define SMC_WRTTIM3_ADDRSETCFG_1                                    (0x2UL << SMC_WRTTIM3_ADDRSETCFG_Pos)                          /*!< 0x00000002 */
#define SMC_WRTTIM3_ADDRSETCFG_2                                    (0x4UL << SMC_WRTTIM3_ADDRSETCFG_Pos)                          /*!< 0x00000004 */
#define SMC_WRTTIM3_ADDRSETCFG_3                                    (0x8UL << SMC_WRTTIM3_ADDRSETCFG_Pos)                          /*!< 0x00000008 */

#define SMC_WRTTIM3_ADDRHLDCFG_Pos                                  (4U)
#define SMC_WRTTIM3_ADDRHLDCFG_Msk                                  (0xFUL << SMC_WRTTIM3_ADDRHLDCFG_Pos)                          /*!< 0x000000F0 */
#define SMC_WRTTIM3_ADDRHLDCFG                                      SMC_WRTTIM3_ADDRHLDCFG_Msk                                     /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define SMC_WRTTIM3_ADDRHLDCFG_0                                    (0x1UL << SMC_WRTTIM3_ADDRHLDCFG_Pos)                          /*!< 0x00000010 */
#define SMC_WRTTIM3_ADDRHLDCFG_1                                    (0x2UL << SMC_WRTTIM3_ADDRHLDCFG_Pos)                          /*!< 0x00000020 */
#define SMC_WRTTIM3_ADDRHLDCFG_2                                    (0x4UL << SMC_WRTTIM3_ADDRHLDCFG_Pos)                          /*!< 0x00000040 */
#define SMC_WRTTIM3_ADDRHLDCFG_3                                    (0x8UL << SMC_WRTTIM3_ADDRHLDCFG_Pos)                          /*!< 0x00000080 */

#define SMC_WRTTIM3_DATASETCFG_Pos                                  (8U)
#define SMC_WRTTIM3_DATASETCFG_Msk                                  (0xFFUL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x0000FF00 */
#define SMC_WRTTIM3_DATASETCFG                                      SMC_WRTTIM3_DATASETCFG_Msk                                     /*!<DATAST [7:0] bits (Data-phase duration) */
#define SMC_WRTTIM3_DATASETCFG_0                                    (0x01UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00000100 */
#define SMC_WRTTIM3_DATASETCFG_1                                    (0x02UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00000200 */
#define SMC_WRTTIM3_DATASETCFG_2                                    (0x04UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00000400 */
#define SMC_WRTTIM3_DATASETCFG_3                                    (0x08UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00000800 */
#define SMC_WRTTIM3_DATASETCFG_4                                    (0x10UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00001000 */
#define SMC_WRTTIM3_DATASETCFG_5                                    (0x20UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00002000 */
#define SMC_WRTTIM3_DATASETCFG_6                                    (0x40UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00004000 */
#define SMC_WRTTIM3_DATASETCFG_7                                    (0x80UL << SMC_WRTTIM3_DATASETCFG_Pos)                         /*!< 0x00008000 */

#define SMC_WRTTIM3_BUSTURNCFG_Pos                                  (16U)
#define SMC_WRTTIM3_BUSTURNCFG_Msk                                  (0xFUL << SMC_WRTTIM3_BUSTURNCFG_Pos)                          /*!< 0x000F0000 */
#define SMC_WRTTIM3_BUSTURNCFG                                      SMC_WRTTIM3_BUSTURNCFG_Msk                                     /*!<BUSTURN[3:0] bits (Bus turnaround duration) */
#define SMC_WRTTIM3_BUSTURNCFG_0                                    (0x1UL << SMC_WRTTIM3_BUSTURNCFG_Pos)                          /*!< 0x00010000 */
#define SMC_WRTTIM3_BUSTURNCFG_1                                    (0x2UL << SMC_WRTTIM3_BUSTURNCFG_Pos)                          /*!< 0x00020000 */
#define SMC_WRTTIM3_BUSTURNCFG_2                                    (0x4UL << SMC_WRTTIM3_BUSTURNCFG_Pos)                          /*!< 0x00040000 */
#define SMC_WRTTIM3_BUSTURNCFG_3                                    (0x8UL << SMC_WRTTIM3_BUSTURNCFG_Pos)                          /*!< 0x00080000 */

#define SMC_WRTTIM3_CLKDIVCFG_Pos                                   (20U)
#define SMC_WRTTIM3_CLKDIVCFG_Msk                                   (0xFUL << SMC_WRTTIM3_CLKDIVCFG_Pos)                           /*!< 0x00F00000 */
#define SMC_WRTTIM3_CLKDIVCFG                                       SMC_WRTTIM3_CLKDIVCFG_Msk                                      /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define SMC_WRTTIM3_CLKDIVCFG_0                                     (0x1UL << SMC_WRTTIM3_CLKDIVCFG_Pos)                           /*!< 0x00100000 */
#define SMC_WRTTIM3_CLKDIVCFG_1                                     (0x2UL << SMC_WRTTIM3_CLKDIVCFG_Pos)                           /*!< 0x00200000 */
#define SMC_WRTTIM3_CLKDIVCFG_2                                     (0x4UL << SMC_WRTTIM3_CLKDIVCFG_Pos)                           /*!< 0x00400000 */
#define SMC_WRTTIM3_CLKDIVCFG_3                                     (0x8UL << SMC_WRTTIM3_CLKDIVCFG_Pos)                           /*!< 0x00800000 */

#define SMC_WRTTIM3_DATLATCFG_Pos                                   (24U)
#define SMC_WRTTIM3_DATLATCFG_Msk                                   (0xFUL << SMC_WRTTIM3_DATLATCFG_Pos)                           /*!< 0x0F000000 */
#define SMC_WRTTIM3_DATLATCFG                                       SMC_WRTTIM3_DATLATCFG_Msk                                      /*!<DATLA[3:0] bits (Data latency) */
#define SMC_WRTTIM3_DATLATCFG_0                                     (0x1UL << SMC_WRTTIM3_DATLATCFG_Pos)                           /*!< 0x01000000 */
#define SMC_WRTTIM3_DATLATCFG_1                                     (0x2UL << SMC_WRTTIM3_DATLATCFG_Pos)                           /*!< 0x02000000 */
#define SMC_WRTTIM3_DATLATCFG_2                                     (0x4UL << SMC_WRTTIM3_DATLATCFG_Pos)                           /*!< 0x04000000 */
#define SMC_WRTTIM3_DATLATCFG_3                                     (0x8UL << SMC_WRTTIM3_DATLATCFG_Pos)                           /*!< 0x08000000 */

