betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
#define SMC_CMSTIM4_WAIT4_Pos                                       (8U)
#define SMC_CMSTIM4_WAIT4_Msk                                       (0xFFUL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x0000FF00 */
#define SMC_CMSTIM4_WAIT4                                           SMC_CMSTIM4_WAIT4_Msk                                          /*!<MEMWAIT4[7:0] bits (Common memory 4 wait time) */
#define SMC_CMSTIM4_WAIT4_0                                         (0x01UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00000100 */
#define SMC_CMSTIM4_WAIT4_1                                         (0x02UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00000200 */
#define SMC_CMSTIM4_WAIT4_2                                         (0x04UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00000400 */
#define SMC_CMSTIM4_WAIT4_3                                         (0x08UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00000800 */
#define SMC_CMSTIM4_WAIT4_4                                         (0x10UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00001000 */
#define SMC_CMSTIM4_WAIT4_5                                         (0x20UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00002000 */
#define SMC_CMSTIM4_WAIT4_6                                         (0x40UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00004000 */
#define SMC_CMSTIM4_WAIT4_7                                         (0x80UL << SMC_CMSTIM4_WAIT4_Pos)                              /*!< 0x00008000 */

#define SMC_CMSTIM4_HLD4_Pos                                        (16U)
#define SMC_CMSTIM4_HLD4_Msk                                        (0xFFUL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00FF0000 */
#define SMC_CMSTIM4_HLD4                                            SMC_CMSTIM4_HLD4_Msk                                           /*!<MEMHOLD4[7:0] bits (Common memory 4 hold time) */
#define SMC_CMSTIM4_HLD4_0                                          (0x01UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00010000 */
#define SMC_CMSTIM4_HLD4_1                                          (0x02UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00020000 */
#define SMC_CMSTIM4_HLD4_2                                          (0x04UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00040000 */
#define SMC_CMSTIM4_HLD4_3                                          (0x08UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00080000 */
#define SMC_CMSTIM4_HLD4_4                                          (0x10UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00100000 */
#define SMC_CMSTIM4_HLD4_5                                          (0x20UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00200000 */
#define SMC_CMSTIM4_HLD4_6                                          (0x40UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00400000 */
#define SMC_CMSTIM4_HLD4_7                                          (0x80UL << SMC_CMSTIM4_HLD4_Pos)                               /*!< 0x00800000 */

#define SMC_CMSTIM4_HIZ4_Pos                                        (24U)
#define SMC_CMSTIM4_HIZ4_Msk                                        (0xFFUL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0xFF000000 */
#define SMC_CMSTIM4_HIZ4                                            SMC_CMSTIM4_HIZ4_Msk                                           /*!<MEMHIZ4[7:0] bits (Common memory 4 databus HiZ time) */
#define SMC_CMSTIM4_HIZ4_0                                          (0x01UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x01000000 */
#define SMC_CMSTIM4_HIZ4_1                                          (0x02UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x02000000 */
#define SMC_CMSTIM4_HIZ4_2                                          (0x04UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x04000000 */
#define SMC_CMSTIM4_HIZ4_3                                          (0x08UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x08000000 */
#define SMC_CMSTIM4_HIZ4_4                                          (0x10UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x10000000 */
#define SMC_CMSTIM4_HIZ4_5                                          (0x20UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x20000000 */
#define SMC_CMSTIM4_HIZ4_6                                          (0x40UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x40000000 */
#define SMC_CMSTIM4_HIZ4_7                                          (0x80UL << SMC_CMSTIM4_HIZ4_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_AMSTIM2 register  ******************/
#define SMC_AMSTIM2_SET2_Pos                                        (0U)
#define SMC_AMSTIM2_SET2_Msk                                        (0xFFUL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x000000FF */
#define SMC_AMSTIM2_SET2                                            SMC_AMSTIM2_SET2_Msk                                           /*!<ATTSET2[7:0] bits (Attribute memory 2 setup time) */
#define SMC_AMSTIM2_SET2_0                                          (0x01UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000001 */
#define SMC_AMSTIM2_SET2_1                                          (0x02UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000002 */
#define SMC_AMSTIM2_SET2_2                                          (0x04UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000004 */
#define SMC_AMSTIM2_SET2_3                                          (0x08UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000008 */
#define SMC_AMSTIM2_SET2_4                                          (0x10UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000010 */
#define SMC_AMSTIM2_SET2_5                                          (0x20UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000020 */
#define SMC_AMSTIM2_SET2_6                                          (0x40UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000040 */
#define SMC_AMSTIM2_SET2_7                                          (0x80UL << SMC_AMSTIM2_SET2_Pos)                               /*!< 0x00000080 */

#define SMC_AMSTIM2_WAIT2_Pos                                       (8U)
#define SMC_AMSTIM2_WAIT2_Msk                                       (0xFFUL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x0000FF00 */
#define SMC_AMSTIM2_WAIT2                                           SMC_AMSTIM2_WAIT2_Msk                                          /*!<ATTWAIT2[7:0] bits (Attribute memory 2 wait time) */
#define SMC_AMSTIM2_WAIT2_0                                         (0x01UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00000100 */
#define SMC_AMSTIM2_WAIT2_1                                         (0x02UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00000200 */
#define SMC_AMSTIM2_WAIT2_2                                         (0x04UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00000400 */
#define SMC_AMSTIM2_WAIT2_3                                         (0x08UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00000800 */
#define SMC_AMSTIM2_WAIT2_4                                         (0x10UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00001000 */
#define SMC_AMSTIM2_WAIT2_5                                         (0x20UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00002000 */
#define SMC_AMSTIM2_WAIT2_6                                         (0x40UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00004000 */
#define SMC_AMSTIM2_WAIT2_7                                         (0x80UL << SMC_AMSTIM2_WAIT2_Pos)                              /*!< 0x00008000 */

#define SMC_AMSTIM2_HLD2_Pos                                        (16U)
#define SMC_AMSTIM2_HLD2_Msk                                        (0xFFUL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00FF0000 */
#define SMC_AMSTIM2_HLD2                                            SMC_AMSTIM2_HLD2_Msk                                           /*!<ATTHOLD2[7:0] bits (Attribute memory 2 hold time) */
#define SMC_AMSTIM2_HLD2_0                                          (0x01UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00010000 */
#define SMC_AMSTIM2_HLD2_1                                          (0x02UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00020000 */
#define SMC_AMSTIM2_HLD2_2                                          (0x04UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00040000 */
#define SMC_AMSTIM2_HLD2_3                                          (0x08UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00080000 */
#define SMC_AMSTIM2_HLD2_4                                          (0x10UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00100000 */
#define SMC_AMSTIM2_HLD2_5                                          (0x20UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00200000 */
#define SMC_AMSTIM2_HLD2_6                                          (0x40UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00400000 */
#define SMC_AMSTIM2_HLD2_7                                          (0x80UL << SMC_AMSTIM2_HLD2_Pos)                               /*!< 0x00800000 */

#define SMC_AMSTIM2_HIZ2_Pos                                        (24U)
#define SMC_AMSTIM2_HIZ2_Msk                                        (0xFFUL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0xFF000000 */
#define SMC_AMSTIM2_HIZ2                                            SMC_AMSTIM2_HIZ2_Msk                                           /*!<ATTHIZ2[7:0] bits (Attribute memory 2 databus HiZ time) */
#define SMC_AMSTIM2_HIZ2_0                                          (0x01UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x01000000 */
#define SMC_AMSTIM2_HIZ2_1                                          (0x02UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x02000000 */
#define SMC_AMSTIM2_HIZ2_2                                          (0x04UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x04000000 */
#define SMC_AMSTIM2_HIZ2_3                                          (0x08UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x08000000 */
#define SMC_AMSTIM2_HIZ2_4                                          (0x10UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x10000000 */
#define SMC_AMSTIM2_HIZ2_5                                          (0x20UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x20000000 */
#define SMC_AMSTIM2_HIZ2_6                                          (0x40UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x40000000 */
#define SMC_AMSTIM2_HIZ2_7                                          (0x80UL << SMC_AMSTIM2_HIZ2_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_AMSTIM3 register  ******************/
#define SMC_AMSTIM3_SET3_Pos                                        (0U)
#define SMC_AMSTIM3_SET3_Msk                                        (0xFFUL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x000000FF */
#define SMC_AMSTIM3_SET3                                            SMC_AMSTIM3_SET3_Msk                                           /*!<ATTSET3[7:0] bits (Attribute memory 3 setup time) */
#define SMC_AMSTIM3_SET3_0                                          (0x01UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000001 */
#define SMC_AMSTIM3_SET3_1                                          (0x02UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000002 */
#define SMC_AMSTIM3_SET3_2                                          (0x04UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000004 */
#define SMC_AMSTIM3_SET3_3                                          (0x08UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000008 */
#define SMC_AMSTIM3_SET3_4                                          (0x10UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000010 */
#define SMC_AMSTIM3_SET3_5                                          (0x20UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000020 */
#define SMC_AMSTIM3_SET3_6                                          (0x40UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000040 */
#define SMC_AMSTIM3_SET3_7                                          (0x80UL << SMC_AMSTIM3_SET3_Pos)                               /*!< 0x00000080 */

#define SMC_AMSTIM3_WAIT3_Pos                                       (8U)
#define SMC_AMSTIM3_WAIT3_Msk                                       (0xFFUL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x0000FF00 */
#define SMC_AMSTIM3_WAIT3                                           SMC_AMSTIM3_WAIT3_Msk                                          /*!<ATTWAIT3[7:0] bits (Attribute memory 3 wait time) */
#define SMC_AMSTIM3_WAIT3_0                                         (0x01UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00000100 */
#define SMC_AMSTIM3_WAIT3_1                                         (0x02UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00000200 */
#define SMC_AMSTIM3_WAIT3_2                                         (0x04UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00000400 */
#define SMC_AMSTIM3_WAIT3_3                                         (0x08UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00000800 */
#define SMC_AMSTIM3_WAIT3_4                                         (0x10UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00001000 */
#define SMC_AMSTIM3_WAIT3_5                                         (0x20UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00002000 */
#define SMC_AMSTIM3_WAIT3_6                                         (0x40UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00004000 */
#define SMC_AMSTIM3_WAIT3_7                                         (0x80UL << SMC_AMSTIM3_WAIT3_Pos)                              /*!< 0x00008000 */

