betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
#define RCM_PLL2CFG_PLL2C_Pos                                       (28U)
#define RCM_PLL2CFG_PLL2C_Msk                                       (0x7UL << RCM_PLL2CFG_PLL2C_Pos)                               /*!< 0x70000000 */
#define RCM_PLL2CFG_PLL2C                                           RCM_PLL2CFG_PLL2C_Msk
#define RCM_PLL2CFG_PLL2C_0                                         (0x1UL << RCM_PLL2CFG_PLL2C_Pos)                               /*!< 0x10000000 */
#define RCM_PLL2CFG_PLL2C_1                                         (0x2UL << RCM_PLL2CFG_PLL2C_Pos)                               /*!< 0x20000000 */
#define RCM_PLL2CFG_PLL2C_2                                         (0x4UL << RCM_PLL2CFG_PLL2C_Pos)                               /*!< 0x40000000 */


/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CTRL register  *******************/
#define RNG_CTRL_RNGEN_Pos                                          (2U)
#define RNG_CTRL_RNGEN_Msk                                          (0x1UL << RNG_CTRL_RNGEN_Pos)                                  /*!< 0x00000004 */
#define RNG_CTRL_RNGEN                                              RNG_CTRL_RNGEN_Msk
#define RNG_CTRL_INTEN_Pos                                          (3U)
#define RNG_CTRL_INTEN_Msk                                          (0x1UL << RNG_CTRL_INTEN_Pos)                                  /*!< 0x00000008 */
#define RNG_CTRL_INTEN                                              RNG_CTRL_INTEN_Msk

/********************  Bits definition for RNG_STS register  *******************/
#define RNG_STS_DATARDY_Pos                                         (0U)
#define RNG_STS_DATARDY_Msk                                         (0x1UL << RNG_STS_DATARDY_Pos)                                 /*!< 0x00000001 */
#define RNG_STS_DATARDY                                             RNG_STS_DATARDY_Msk
#define RNG_STS_CLKERCSTS_Pos                                       (1U)
#define RNG_STS_CLKERCSTS_Msk                                       (0x1UL << RNG_STS_CLKERCSTS_Pos)                               /*!< 0x00000002 */
#define RNG_STS_CLKERCSTS                                           RNG_STS_CLKERCSTS_Msk
#define RNG_STS_FSCSTS_Pos                                          (2U)
#define RNG_STS_FSCSTS_Msk                                          (0x1UL << RNG_STS_FSCSTS_Pos)                                  /*!< 0x00000004 */
#define RNG_STS_FSCSTS                                              RNG_STS_FSCSTS_Msk
#define RNG_STS_CLKERINT_Pos                                        (5U)
#define RNG_STS_CLKERINT_Msk                                        (0x1UL << RNG_STS_CLKERINT_Pos)                                /*!< 0x00000020 */
#define RNG_STS_CLKERINT                                            RNG_STS_CLKERINT_Msk
#define RNG_STS_FSINT_Pos                                           (6U)
#define RNG_STS_FSINT_Msk                                           (0x1UL << RNG_STS_FSINT_Pos)                                   /*!< 0x00000040 */
#define RNG_STS_FSINT                                               RNG_STS_FSINT_Msk

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions  (not present on all devices in the APM32F4 serie)
 */
#define RTC_TAMPER2_SUPPORT                                                                                                        /*!< TAMPER 2 feature support */
#define RTC_AF2_SUPPORT                                                                                                            /*!< RTC Alternate Function 2 mapping support */
#define RTC_ALARMA_SUPPORT                                                                                                         /*!< ALARMA feature support */
#define RTC_ALARMB_SUPPORT                                                                                                         /*!< ALARMA feature support */
#define RTC_TAMPER_SUPPORT                                                                                                         /*!< TAMPER feature support */
#define RTC_TIMESTAMP_SUPPORT                                                                                                      /*!< TIMESTAMP feature support */
#define RTC_CALENDAR_SUPPORT                                                                                                       /*!< CALENDAR feature support */
#define RTC_WAKEUP_SUPPORT                                                                                                         /*!< WAKEUP feature support */
#define RTC_CALIBRATION_SUPPORT                                                                                                    /*!< CALIBRATION feature support */
#define RTC_TIME_SUPPORT                                                                                                           /*!< TIME feature support */
/********************  Bits definition for RTC_TIME register  *******************/
#define RTC_TIME_TIMEFCFG_Pos                                       (22U)
#define RTC_TIME_TIMEFCFG_Msk                                       (0x1UL << RTC_TIME_TIMEFCFG_Pos)                               /*!< 0x00400000 */
#define RTC_TIME_TIMEFCFG                                           RTC_TIME_TIMEFCFG_Msk
#define RTC_TIME_HRT_Pos                                            (20U)
#define RTC_TIME_HRT_Msk                                            (0x3UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00300000 */
#define RTC_TIME_HRT                                                RTC_TIME_HRT_Msk
#define RTC_TIME_HRT_0                                              (0x1UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00100000 */
#define RTC_TIME_HRT_1                                              (0x2UL << RTC_TIME_HRT_Pos)                                    /*!< 0x00200000 */
#define RTC_TIME_HRU_Pos                                            (16U)
#define RTC_TIME_HRU_Msk                                            (0xFUL << RTC_TIME_HRU_Pos)                                    /*!< 0x000F0000 */
#define RTC_TIME_HRU                                                RTC_TIME_HRU_Msk
#define RTC_TIME_HRU_0                                              (0x1UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00010000 */
#define RTC_TIME_HRU_1                                              (0x2UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00020000 */
#define RTC_TIME_HRU_2                                              (0x4UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00040000 */
#define RTC_TIME_HRU_3                                              (0x8UL << RTC_TIME_HRU_Pos)                                    /*!< 0x00080000 */
#define RTC_TIME_MINT_Pos                                           (12U)
#define RTC_TIME_MINT_Msk                                           (0x7UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00007000 */
#define RTC_TIME_MINT                                               RTC_TIME_MINT_Msk
#define RTC_TIME_MINT_0                                             (0x1UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00001000 */
#define RTC_TIME_MINT_1                                             (0x2UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00002000 */
#define RTC_TIME_MINT_2                                             (0x4UL << RTC_TIME_MINT_Pos)                                   /*!< 0x00004000 */
#define RTC_TIME_MINU_Pos                                           (8U)
#define RTC_TIME_MINU_Msk                                           (0xFUL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000F00 */
#define RTC_TIME_MINU                                               RTC_TIME_MINU_Msk
#define RTC_TIME_MINU_0                                             (0x1UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000100 */
#define RTC_TIME_MINU_1                                             (0x2UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000200 */
#define RTC_TIME_MINU_2                                             (0x4UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000400 */
#define RTC_TIME_MINU_3                                             (0x8UL << RTC_TIME_MINU_Pos)                                   /*!< 0x00000800 */
#define RTC_TIME_SECT_Pos                                           (4U)
#define RTC_TIME_SECT_Msk                                           (0x7UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000070 */
#define RTC_TIME_SECT                                               RTC_TIME_SECT_Msk
#define RTC_TIME_SECT_0                                             (0x1UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000010 */
#define RTC_TIME_SECT_1                                             (0x2UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000020 */
#define RTC_TIME_SECT_2                                             (0x4UL << RTC_TIME_SECT_Pos)                                   /*!< 0x00000040 */
#define RTC_TIME_SECU_Pos                                           (0U)
#define RTC_TIME_SECU_Msk                                           (0xFUL << RTC_TIME_SECU_Pos)                                   /*!< 0x0000000F */
#define RTC_TIME_SECU                                               RTC_TIME_SECU_Msk
#define RTC_TIME_SECU_0                                             (0x1UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000001 */
#define RTC_TIME_SECU_1                                             (0x2UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000002 */
#define RTC_TIME_SECU_2                                             (0x4UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000004 */
#define RTC_TIME_SECU_3                                             (0x8UL << RTC_TIME_SECU_Pos)                                   /*!< 0x00000008 */

/********************  Bits definition for RTC_DATE register  *******************/
#define RTC_DATE_YRT_Pos                                            (20U)
#define RTC_DATE_YRT_Msk                                            (0xFUL << RTC_DATE_YRT_Pos)                                    /*!< 0x00F00000 */
#define RTC_DATE_YRT                                                RTC_DATE_YRT_Msk
#define RTC_DATE_YRT_0                                              (0x1UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00100000 */
#define RTC_DATE_YRT_1                                              (0x2UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00200000 */
#define RTC_DATE_YRT_2                                              (0x4UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00400000 */
#define RTC_DATE_YRT_3                                              (0x8UL << RTC_DATE_YRT_Pos)                                    /*!< 0x00800000 */
#define RTC_DATE_YRU_Pos                                            (16U)
#define RTC_DATE_YRU_Msk                                            (0xFUL << RTC_DATE_YRU_Pos)                                    /*!< 0x000F0000 */
#define RTC_DATE_YRU                                                RTC_DATE_YRU_Msk
#define RTC_DATE_YRU_0                                              (0x1UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00010000 */
#define RTC_DATE_YRU_1                                              (0x2UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00020000 */
#define RTC_DATE_YRU_2                                              (0x4UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00040000 */
#define RTC_DATE_YRU_3                                              (0x8UL << RTC_DATE_YRU_Pos)                                    /*!< 0x00080000 */
#define RTC_DATE_WEEKSEL_Pos                                        (13U)
#define RTC_DATE_WEEKSEL_Msk                                        (0x7UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x0000E000 */
#define RTC_DATE_WEEKSEL                                            RTC_DATE_WEEKSEL_Msk
#define RTC_DATE_WEEKSEL_0                                          (0x1UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00002000 */
#define RTC_DATE_WEEKSEL_1                                          (0x2UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00004000 */
#define RTC_DATE_WEEKSEL_2                                          (0x4UL << RTC_DATE_WEEKSEL_Pos)                                /*!< 0x00008000 */
#define RTC_DATE_MONT_Pos                                           (12U)
#define RTC_DATE_MONT_Msk                                           (0x1UL << RTC_DATE_MONT_Pos)                                   /*!< 0x00001000 */
#define RTC_DATE_MONT                                               RTC_DATE_MONT_Msk
#define RTC_DATE_MONU_Pos                                           (8U)
#define RTC_DATE_MONU_Msk                                           (0xFUL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000F00 */
#define RTC_DATE_MONU                                               RTC_DATE_MONU_Msk
#define RTC_DATE_MONU_0                                             (0x1UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000100 */
#define RTC_DATE_MONU_1                                             (0x2UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000200 */
#define RTC_DATE_MONU_2                                             (0x4UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000400 */
#define RTC_DATE_MONU_3                                             (0x8UL << RTC_DATE_MONU_Pos)                                   /*!< 0x00000800 */
#define RTC_DATE_DAYT_Pos                                           (4U)
#define RTC_DATE_DAYT_Msk                                           (0x3UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000030 */
#define RTC_DATE_DAYT                                               RTC_DATE_DAYT_Msk
#define RTC_DATE_DAYT_0                                             (0x1UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000010 */
#define RTC_DATE_DAYT_1                                             (0x2UL << RTC_DATE_DAYT_Pos)                                   /*!< 0x00000020 */
#define RTC_DATE_DAYU_Pos                                           (0U)
#define RTC_DATE_DAYU_Msk                                           (0xFUL << RTC_DATE_DAYU_Pos)                                   /*!< 0x0000000F */
#define RTC_DATE_DAYU                                               RTC_DATE_DAYU_Msk
#define RTC_DATE_DAYU_0                                             (0x1UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000001 */
#define RTC_DATE_DAYU_1                                             (0x2UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000002 */
#define RTC_DATE_DAYU_2                                             (0x4UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000004 */
#define RTC_DATE_DAYU_3                                             (0x8UL << RTC_DATE_DAYU_Pos)                                   /*!< 0x00000008 */

/********************  Bits definition for RTC_CTRL register  *******************/
#define RTC_CTRL_CALOEN_Pos                                         (23U)
#define RTC_CTRL_CALOEN_Msk                                         (0x1UL << RTC_CTRL_CALOEN_Pos)                                 /*!< 0x00800000 */
#define RTC_CTRL_CALOEN                                             RTC_CTRL_CALOEN_Msk
#define RTC_CTRL_OUTSEL_Pos                                         (21U)
#define RTC_CTRL_OUTSEL_Msk                                         (0x3UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00600000 */
#define RTC_CTRL_OUTSEL                                             RTC_CTRL_OUTSEL_Msk
#define RTC_CTRL_OUTSEL_0                                           (0x1UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00200000 */
#define RTC_CTRL_OUTSEL_1                                           (0x2UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00400000 */
#define RTC_CTRL_POLCFG_Pos                                         (20U)
#define RTC_CTRL_POLCFG_Msk                                         (0x1UL << RTC_CTRL_POLCFG_Pos)                                 /*!< 0x00100000 */
#define RTC_CTRL_POLCFG                                             RTC_CTRL_POLCFG_Msk
#define RTC_CTRL_CALOSEL_Pos                                        (19U)
#define RTC_CTRL_CALOSEL_Msk                                        (0x1UL << RTC_CTRL_CALOSEL_Pos)                                /*!< 0x00080000 */
#define RTC_CTRL_CALOSEL                                            RTC_CTRL_CALOSEL_Msk
#define RTC_CTRL_BAKP_Pos                                           (18U)
#define RTC_CTRL_BAKP_Msk                                           (0x1UL << RTC_CTRL_BAKP_Pos)                                   /*!< 0x00040000 */
#define RTC_CTRL_BAKP                                               RTC_CTRL_BAKP_Msk
#define RTC_CTRL_WTCCFG_Pos                                         (17U)
#define RTC_CTRL_WTCCFG_Msk                                         (0x1UL << RTC_CTRL_WTCCFG_Pos)                                 /*!< 0x00020000 */
#define RTC_CTRL_WTCCFG                                             RTC_CTRL_WTCCFG_Msk
#define RTC_CTRL_STCCFG_Pos                                         (16U)
#define RTC_CTRL_STCCFG_Msk                                         (0x1UL << RTC_CTRL_STCCFG_Pos)                                 /*!< 0x00010000 */
#define RTC_CTRL_STCCFG                                             RTC_CTRL_STCCFG_Msk
#define RTC_CTRL_TSIEN_Pos                                          (15U)
#define RTC_CTRL_TSIEN_Msk                                          (0x1UL << RTC_CTRL_TSIEN_Pos)                                  /*!< 0x00008000 */
#define RTC_CTRL_TSIEN                                              RTC_CTRL_TSIEN_Msk
#define RTC_CTRL_WUTIEN_Pos                                         (14U)
#define RTC_CTRL_WUTIEN_Msk                                         (0x1UL << RTC_CTRL_WUTIEN_Pos)                                 /*!< 0x00004000 */
#define RTC_CTRL_WUTIEN                                             RTC_CTRL_WUTIEN_Msk
#define RTC_CTRL_ALRBIEN_Pos                                        (13U)
#define RTC_CTRL_ALRBIEN_Msk                                        (0x1UL << RTC_CTRL_ALRBIEN_Pos)                                /*!< 0x00002000 */
#define RTC_CTRL_ALRBIEN                                            RTC_CTRL_ALRBIEN_Msk
#define RTC_CTRL_ALRAIEN_Pos                                        (12U)
#define RTC_CTRL_ALRAIEN_Msk                                        (0x1UL << RTC_CTRL_ALRAIEN_Pos)                                /*!< 0x00001000 */
#define RTC_CTRL_ALRAIEN                                            RTC_CTRL_ALRAIEN_Msk
#define RTC_CTRL_TSEN_Pos                                           (11U)
#define RTC_CTRL_TSEN_Msk                                           (0x1UL << RTC_CTRL_TSEN_Pos)                                   /*!< 0x00000800 */
#define RTC_CTRL_TSEN                                               RTC_CTRL_TSEN_Msk
#define RTC_CTRL_WUTEN_Pos                                          (10U)
#define RTC_CTRL_WUTEN_Msk                                          (0x1UL << RTC_CTRL_WUTEN_Pos)                                  /*!< 0x00000400 */
#define RTC_CTRL_WUTEN                                              RTC_CTRL_WUTEN_Msk
#define RTC_CTRL_ALRBEN_Pos                                         (9U)
#define RTC_CTRL_ALRBEN_Msk                                         (0x1UL << RTC_CTRL_ALRBEN_Pos)                                 /*!< 0x00000200 */
#define RTC_CTRL_ALRBEN                                             RTC_CTRL_ALRBEN_Msk
#define RTC_CTRL_ALRAEN_Pos                                         (8U)
#define RTC_CTRL_ALRAEN_Msk                                         (0x1UL << RTC_CTRL_ALRAEN_Pos)                                 /*!< 0x00000100 */
#define RTC_CTRL_ALRAEN                                             RTC_CTRL_ALRAEN_Msk
#define RTC_CTRL_DCALEN_Pos                                         (7U)
#define RTC_CTRL_DCALEN_Msk                                         (0x1UL << RTC_CTRL_DCALEN_Pos)                                 /*!< 0x00000080 */
#define RTC_CTRL_DCALEN                                             RTC_CTRL_DCALEN_Msk
#define RTC_CTRL_TIMEFCFG_Pos                                       (6U)
#define RTC_CTRL_TIMEFCFG_Msk                                       (0x1UL << RTC_CTRL_TIMEFCFG_Pos)                               /*!< 0x00000040 */
#define RTC_CTRL_TIMEFCFG                                           RTC_CTRL_TIMEFCFG_Msk
#define RTC_CTRL_RCMCFG_Pos                                         (5U)
#define RTC_CTRL_RCMCFG_Msk                                         (0x1UL << RTC_CTRL_RCMCFG_Pos)                                 /*!< 0x00000020 */
#define RTC_CTRL_RCMCFG                                             RTC_CTRL_RCMCFG_Msk
#define RTC_CTRL_RCLKDEN_Pos                                        (4U)
#define RTC_CTRL_RCLKDEN_Msk                                        (0x1UL << RTC_CTRL_RCLKDEN_Pos)                                /*!< 0x00000010 */
#define RTC_CTRL_RCLKDEN                                            RTC_CTRL_RCLKDEN_Msk
#define RTC_CTRL_TSETECFG_Pos                                       (3U)
#define RTC_CTRL_TSETECFG_Msk                                       (0x1UL << RTC_CTRL_TSETECFG_Pos)                               /*!< 0x00000008 */
#define RTC_CTRL_TSETECFG                                           RTC_CTRL_TSETECFG_Msk
#define RTC_CTRL_WUCLKSEL_Pos                                       (0U)
#define RTC_CTRL_WUCLKSEL_Msk                                       (0x7UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000007 */
#define RTC_CTRL_WUCLKSEL                                           RTC_CTRL_WUCLKSEL_Msk
#define RTC_CTRL_WUCLKSEL_0                                         (0x1UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000001 */
#define RTC_CTRL_WUCLKSEL_1                                         (0x2UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000002 */
#define RTC_CTRL_WUCLKSEL_2                                         (0x4UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000004 */

