betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
/* Legacy defines */
#define RTC_TACFG_TAMPINSEL                                         RTC_TACFG_TP1MSEL

/********************  Bits definition for RTC_ALRMASS register  *************/
#define RTC_ALRMASS_MASKSEL_Pos                                     (24U)
#define RTC_ALRMASS_MASKSEL_Msk                                     (0xFUL << RTC_ALRMASS_MASKSEL_Pos)                             /*!< 0x0F000000 */
#define RTC_ALRMASS_MASKSEL                                         RTC_ALRMASS_MASKSEL_Msk
#define RTC_ALRMASS_MASKSEL_0                                       (0x1UL << RTC_ALRMASS_MASKSEL_Pos)                             /*!< 0x01000000 */
#define RTC_ALRMASS_MASKSEL_1                                       (0x2UL << RTC_ALRMASS_MASKSEL_Pos)                             /*!< 0x02000000 */
#define RTC_ALRMASS_MASKSEL_2                                       (0x4UL << RTC_ALRMASS_MASKSEL_Pos)                             /*!< 0x04000000 */
#define RTC_ALRMASS_MASKSEL_3                                       (0x8UL << RTC_ALRMASS_MASKSEL_Pos)                             /*!< 0x08000000 */
#define RTC_ALRMASS_SUBSEC_Pos                                      (0U)
#define RTC_ALRMASS_SUBSEC_Msk                                      (0x7FFFUL << RTC_ALRMASS_SUBSEC_Pos)                           /*!< 0x00007FFF */
#define RTC_ALRMASS_SUBSEC                                          RTC_ALRMASS_SUBSEC_Msk

/********************  Bits definition for RTC_ALRMBSS register  *************/
#define RTC_ALRMBSS_MASKSEL_Pos                                     (24U)
#define RTC_ALRMBSS_MASKSEL_Msk                                     (0xFUL << RTC_ALRMBSS_MASKSEL_Pos)                             /*!< 0x0F000000 */
#define RTC_ALRMBSS_MASKSEL                                         RTC_ALRMBSS_MASKSEL_Msk
#define RTC_ALRMBSS_MASKSEL_0                                       (0x1UL << RTC_ALRMBSS_MASKSEL_Pos)                             /*!< 0x01000000 */
#define RTC_ALRMBSS_MASKSEL_1                                       (0x2UL << RTC_ALRMBSS_MASKSEL_Pos)                             /*!< 0x02000000 */
#define RTC_ALRMBSS_MASKSEL_2                                       (0x4UL << RTC_ALRMBSS_MASKSEL_Pos)                             /*!< 0x04000000 */
#define RTC_ALRMBSS_MASKSEL_3                                       (0x8UL << RTC_ALRMBSS_MASKSEL_Pos)                             /*!< 0x08000000 */
#define RTC_ALRMBSS_SUBSEC_Pos                                      (0U)
#define RTC_ALRMBSS_SUBSEC_Msk                                      (0x7FFFUL << RTC_ALRMBSS_SUBSEC_Pos)                           /*!< 0x00007FFF */
#define RTC_ALRMBSS_SUBSEC                                          RTC_ALRMBSS_SUBSEC_Msk

/********************  Bits definition for RTC_BAKP0 register  ****************/
#define RTC_BAKP0_BAKP_Pos                                          (0U)
#define RTC_BAKP0_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP0_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP0_BAKP                                              RTC_BAKP0_BAKP_Msk

/********************  Bits definition for RTC_BAKP1 register  ****************/
#define RTC_BAKP1_BAKP_Pos                                          (0U)
#define RTC_BAKP1_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP1_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP1_BAKP                                              RTC_BAKP1_BAKP_Msk

/********************  Bits definition for RTC_BAKP2 register  ****************/
#define RTC_BAKP2_BAKP_Pos                                          (0U)
#define RTC_BAKP2_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP2_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP2_BAKP                                              RTC_BAKP2_BAKP_Msk

/********************  Bits definition for RTC_BAKP3 register  ****************/
#define RTC_BAKP3_BAKP_Pos                                          (0U)
#define RTC_BAKP3_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP3_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP3_BAKP                                              RTC_BAKP3_BAKP_Msk

/********************  Bits definition for RTC_BAKP4 register  ****************/
#define RTC_BAKP4_BAKP_Pos                                          (0U)
#define RTC_BAKP4_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP4_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP4_BAKP                                              RTC_BAKP4_BAKP_Msk

/********************  Bits definition for RTC_BAKP5 register  ****************/
#define RTC_BAKP5_BAKP_Pos                                          (0U)
#define RTC_BAKP5_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP5_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP5_BAKP                                              RTC_BAKP5_BAKP_Msk

/********************  Bits definition for RTC_BAKP6 register  ****************/
#define RTC_BAKP6_BAKP_Pos                                          (0U)
#define RTC_BAKP6_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP6_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP6_BAKP                                              RTC_BAKP6_BAKP_Msk

/********************  Bits definition for RTC_BAKP7 register  ****************/
#define RTC_BAKP7_BAKP_Pos                                          (0U)
#define RTC_BAKP7_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP7_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP7_BAKP                                              RTC_BAKP7_BAKP_Msk

/********************  Bits definition for RTC_BAKP8 register  ****************/
#define RTC_BAKP8_BAKP_Pos                                          (0U)
#define RTC_BAKP8_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP8_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP8_BAKP                                              RTC_BAKP8_BAKP_Msk

/********************  Bits definition for RTC_BAKP9 register  ****************/
#define RTC_BAKP9_BAKP_Pos                                          (0U)
#define RTC_BAKP9_BAKP_Msk                                          (0xFFFFFFFFUL << RTC_BAKP9_BAKP_Pos)                           /*!< 0xFFFFFFFF */
#define RTC_BAKP9_BAKP                                              RTC_BAKP9_BAKP_Msk

/********************  Bits definition for RTC_BAKP10 register  ***************/
#define RTC_BAKP10_BAKP_Pos                                         (0U)
#define RTC_BAKP10_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP10_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP10_BAKP                                             RTC_BAKP10_BAKP_Msk

/********************  Bits definition for RTC_BAKP11 register  ***************/
#define RTC_BAKP11_BAKP_Pos                                         (0U)
#define RTC_BAKP11_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP11_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP11_BAKP                                             RTC_BAKP11_BAKP_Msk

/********************  Bits definition for RTC_BAKP12 register  ***************/
#define RTC_BAKP12_BAKP_Pos                                         (0U)
#define RTC_BAKP12_BAKP_Msk                                         (0xFFFFFFFFUL << RTC_BAKP12_BAKP_Pos)                          /*!< 0xFFFFFFFF */
#define RTC_BAKP12_BAKP                                             RTC_BAKP12_BAKP_Msk

