betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
/*******************  Bit definition for SDIO_ARG register  *******************/
#define SDIO_ARG_CMDARG_Pos                                         (0U)
#define SDIO_ARG_CMDARG_Msk                                         (0xFFFFFFFFUL << SDIO_ARG_CMDARG_Pos)                          /*!< 0xFFFFFFFF */
#define SDIO_ARG_CMDARG                                             SDIO_ARG_CMDARG_Msk                                            /*!<Command argument */

/*******************  Bit definition for SDIO_CMD register  *******************/
#define SDIO_CMD_CMDINDEX_Pos                                       (0U)
#define SDIO_CMD_CMDINDEX_Msk                                       (0x3FUL << SDIO_CMD_CMDINDEX_Pos)                              /*!< 0x0000003F */
#define SDIO_CMD_CMDINDEX                                           SDIO_CMD_CMDINDEX_Msk                                          /*!<Command Index                               */

#define SDIO_CMD_WAITRES_Pos                                        (6U)
#define SDIO_CMD_WAITRES_Msk                                        (0x3UL << SDIO_CMD_WAITRES_Pos)                                /*!< 0x000000C0 */
#define SDIO_CMD_WAITRES                                            SDIO_CMD_WAITRES_Msk                                           /*!<WAITRESP[1:0] bits (Wait for response bits) */
#define SDIO_CMD_WAITRES_0                                          (0x1UL << SDIO_CMD_WAITRES_Pos)                                /*!< 0x0040 */
#define SDIO_CMD_WAITRES_1                                          (0x2UL << SDIO_CMD_WAITRES_Pos)                                /*!< 0x0080 */

#define SDIO_CMD_WAITINT_Pos                                        (8U)
#define SDIO_CMD_WAITINT_Msk                                        (0x1UL << SDIO_CMD_WAITINT_Pos)                                /*!< 0x00000100 */
#define SDIO_CMD_WAITINT                                            SDIO_CMD_WAITINT_Msk                                           /*!<CPSM Waits for Interrupt Request                               */
#define SDIO_CMD_WENDDATA_Pos                                       (9U)
#define SDIO_CMD_WENDDATA_Msk                                       (0x1UL << SDIO_CMD_WENDDATA_Pos)                               /*!< 0x00000200 */
#define SDIO_CMD_WENDDATA                                           SDIO_CMD_WENDDATA_Msk                                          /*!<CPSM Waits for ends of data transfer (CmdPend internal signal) */
#define SDIO_CMD_CPSMEN_Pos                                         (10U)
#define SDIO_CMD_CPSMEN_Msk                                         (0x1UL << SDIO_CMD_CPSMEN_Pos)                                 /*!< 0x00000400 */
#define SDIO_CMD_CPSMEN                                             SDIO_CMD_CPSMEN_Msk                                            /*!<Command path state machine (CPSM) Enable bit                   */
#define SDIO_CMD_SDIOSC_Pos                                         (11U)
#define SDIO_CMD_SDIOSC_Msk                                         (0x1UL << SDIO_CMD_SDIOSC_Pos)                                 /*!< 0x00000800 */
#define SDIO_CMD_SDIOSC                                             SDIO_CMD_SDIOSC_Msk                                            /*!<SD I/O suspend command                                         */
#define SDIO_CMD_CMDCPEN_Pos                                        (12U)
#define SDIO_CMD_CMDCPEN_Msk                                        (0x1UL << SDIO_CMD_CMDCPEN_Pos)                                /*!< 0x00001000 */
#define SDIO_CMD_CMDCPEN                                            SDIO_CMD_CMDCPEN_Msk                                           /*!<Enable CMD completion                                          */
#define SDIO_CMD_INTEN_Pos                                          (13U)
#define SDIO_CMD_INTEN_Msk                                          (0x1UL << SDIO_CMD_INTEN_Pos)                                  /*!< 0x00002000 */
#define SDIO_CMD_INTEN                                              SDIO_CMD_INTEN_Msk                                             /*!<Not Interrupt Enable                                           */
#define SDIO_CMD_ATACMD_Pos                                         (14U)
#define SDIO_CMD_ATACMD_Msk                                         (0x1UL << SDIO_CMD_ATACMD_Pos)                                 /*!< 0x00004000 */
#define SDIO_CMD_ATACMD                                             SDIO_CMD_ATACMD_Msk                                            /*!<CE-ATA command                                                 */

/*****************  Bit definition for SDIO_CMDRES register  *****************/
#define SDIO_CMDRES_CMDRES_Pos                                      (0U)
#define SDIO_CMDRES_CMDRES_Msk                                      (0x3FUL << SDIO_CMDRES_CMDRES_Pos)                             /*!< 0x0000003F */
#define SDIO_CMDRES_CMDRES                                          SDIO_CMDRES_CMDRES_Msk                                         /*!<Response command index */

/******************  Bit definition for SDIO_RES0 register  ******************/
#define SDIO_RES0_CARDSTS0_Pos                                      (0U)
#define SDIO_RES0_CARDSTS0_Msk                                      (0xFFFFFFFFUL << SDIO_RES0_CARDSTS0_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_RES0_CARDSTS0                                          SDIO_RES0_CARDSTS0_Msk                                         /*!<Card Status */

/******************  Bit definition for SDIO_RES1 register  ******************/
#define SDIO_RES1_CARDSTS1_Pos                                      (0U)
#define SDIO_RES1_CARDSTS1_Msk                                      (0xFFFFFFFFUL << SDIO_RES1_CARDSTS1_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_RES1_CARDSTS1                                          SDIO_RES1_CARDSTS1_Msk                                         /*!<Card Status */

/******************  Bit definition for SDIO_RES2 register  ******************/
#define SDIO_RES2_CARDSTS2_Pos                                      (0U)
#define SDIO_RES2_CARDSTS2_Msk                                      (0xFFFFFFFFUL << SDIO_RES2_CARDSTS2_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_RES2_CARDSTS2                                          SDIO_RES2_CARDSTS2_Msk                                         /*!<Card Status */

/******************  Bit definition for SDIO_RES3 register  ******************/
#define SDIO_RES3_CARDSTS3_Pos                                      (0U)
#define SDIO_RES3_CARDSTS3_Msk                                      (0xFFFFFFFFUL << SDIO_RES3_CARDSTS3_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_RES3_CARDSTS3                                          SDIO_RES3_CARDSTS3_Msk                                         /*!<Card Status */

/******************  Bit definition for SDIO_RES4 register  ******************/
#define SDIO_RES4_CARDSTS4_Pos                                      (0U)
#define SDIO_RES4_CARDSTS4_Msk                                      (0xFFFFFFFFUL << SDIO_RES4_CARDSTS4_Pos)                       /*!< 0xFFFFFFFF */
#define SDIO_RES4_CARDSTS4                                          SDIO_RES4_CARDSTS4_Msk                                         /*!<Card Status */

/******************  Bit definition for SDIO_DATATIME register  *****************/
#define SDIO_DATATIME_DATATIME_Pos                                  (0U)
#define SDIO_DATATIME_DATATIME_Msk                                  (0xFFFFFFFFUL << SDIO_DATATIME_DATATIME_Pos)                   /*!< 0xFFFFFFFF */
#define SDIO_DATATIME_DATATIME                                      SDIO_DATATIME_DATATIME_Msk                                     /*!<Data timeout period. */

