betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
/******************  Bit definition for SDIO_DATALEN register  *******************/
#define SDIO_DATALEN_DATALEN_Pos                                    (0U)
#define SDIO_DATALEN_DATALEN_Msk                                    (0x1FFFFFFUL << SDIO_DATALEN_DATALEN_Pos)                      /*!< 0x01FFFFFF */
#define SDIO_DATALEN_DATALEN                                        SDIO_DATALEN_DATALEN_Msk                                       /*!<Data length value    */

/******************  Bit definition for SDIO_DCTRL register  ******************/
#define SDIO_DCTRL_DTEN_Pos                                         (0U)
#define SDIO_DCTRL_DTEN_Msk                                         (0x1UL << SDIO_DCTRL_DTEN_Pos)                                 /*!< 0x00000001 */
#define SDIO_DCTRL_DTEN                                             SDIO_DCTRL_DTEN_Msk                                            /*!<Data transfer enabled bit         */
#define SDIO_DCTRL_DTDRCFG_Pos                                      (1U)
#define SDIO_DCTRL_DTDRCFG_Msk                                      (0x1UL << SDIO_DCTRL_DTDRCFG_Pos)                              /*!< 0x00000002 */
#define SDIO_DCTRL_DTDRCFG                                          SDIO_DCTRL_DTDRCFG_Msk                                         /*!<Data transfer direction selection */
#define SDIO_DCTRL_DTSEL_Pos                                        (2U)
#define SDIO_DCTRL_DTSEL_Msk                                        (0x1UL << SDIO_DCTRL_DTSEL_Pos)                                /*!< 0x00000004 */
#define SDIO_DCTRL_DTSEL                                            SDIO_DCTRL_DTSEL_Msk                                           /*!<Data transfer mode selection      */
#define SDIO_DCTRL_DMAEN_Pos                                        (3U)
#define SDIO_DCTRL_DMAEN_Msk                                        (0x1UL << SDIO_DCTRL_DMAEN_Pos)                                /*!< 0x00000008 */
#define SDIO_DCTRL_DMAEN                                            SDIO_DCTRL_DMAEN_Msk                                           /*!<DMA enabled bit                   */

#define SDIO_DCTRL_DBSIZE_Pos                                       (4U)
#define SDIO_DCTRL_DBSIZE_Msk                                       (0xFUL << SDIO_DCTRL_DBSIZE_Pos)                               /*!< 0x000000F0 */
#define SDIO_DCTRL_DBSIZE                                           SDIO_DCTRL_DBSIZE_Msk                                          /*!<DBLOCKSIZE[3:0] bits (Data block size) */
#define SDIO_DCTRL_DBSIZE_0                                         (0x1UL << SDIO_DCTRL_DBSIZE_Pos)                               /*!< 0x0010 */
#define SDIO_DCTRL_DBSIZE_1                                         (0x2UL << SDIO_DCTRL_DBSIZE_Pos)                               /*!< 0x0020 */
#define SDIO_DCTRL_DBSIZE_2                                         (0x4UL << SDIO_DCTRL_DBSIZE_Pos)                               /*!< 0x0040 */
#define SDIO_DCTRL_DBSIZE_3                                         (0x8UL << SDIO_DCTRL_DBSIZE_Pos)                               /*!< 0x0080 */

#define SDIO_DCTRL_RWSTR_Pos                                        (8U)
#define SDIO_DCTRL_RWSTR_Msk                                        (0x1UL << SDIO_DCTRL_RWSTR_Pos)                                /*!< 0x00000100 */
#define SDIO_DCTRL_RWSTR                                            SDIO_DCTRL_RWSTR_Msk                                           /*!<Read wait start         */
#define SDIO_DCTRL_RWSTOP_Pos                                       (9U)
#define SDIO_DCTRL_RWSTOP_Msk                                       (0x1UL << SDIO_DCTRL_RWSTOP_Pos)                               /*!< 0x00000200 */
#define SDIO_DCTRL_RWSTOP                                           SDIO_DCTRL_RWSTOP_Msk                                          /*!<Read wait stop          */
#define SDIO_DCTRL_RDWAIT_Pos                                       (10U)
#define SDIO_DCTRL_RDWAIT_Msk                                       (0x1UL << SDIO_DCTRL_RDWAIT_Pos)                               /*!< 0x00000400 */
#define SDIO_DCTRL_RDWAIT                                           SDIO_DCTRL_RDWAIT_Msk                                          /*!<Read wait mode          */
#define SDIO_DCTRL_SDIOF_Pos                                        (11U)
#define SDIO_DCTRL_SDIOF_Msk                                        (0x1UL << SDIO_DCTRL_SDIOF_Pos)                                /*!< 0x00000800 */
#define SDIO_DCTRL_SDIOF                                            SDIO_DCTRL_SDIOF_Msk                                           /*!<SD I/O enable functions */

/******************  Bit definition for SDIO_DCNT register  *****************/
#define SDIO_DCNT_DATACNT_Pos                                       (0U)
#define SDIO_DCNT_DATACNT_Msk                                       (0x1FFFFFFUL << SDIO_DCNT_DATACNT_Pos)                         /*!< 0x01FFFFFF */
#define SDIO_DCNT_DATACNT                                           SDIO_DCNT_DATACNT_Msk                                          /*!<Data count value */

/******************  Bit definition for SDIO_STS register  ********************/
#define SDIO_STS_COMRESP_Pos                                        (0U)
#define SDIO_STS_COMRESP_Msk                                        (0x1UL << SDIO_STS_COMRESP_Pos)                                /*!< 0x00000001 */
#define SDIO_STS_COMRESP                                            SDIO_STS_COMRESP_Msk                                           /*!<Command response received (CRC check failed)  */
#define SDIO_STS_DBDR_Pos                                           (1U)
#define SDIO_STS_DBDR_Msk                                           (0x1UL << SDIO_STS_DBDR_Pos)                                   /*!< 0x00000002 */
#define SDIO_STS_DBDR                                               SDIO_STS_DBDR_Msk                                              /*!<Data block sent/received (CRC check failed)   */
#define SDIO_STS_CMDRESTO_Pos                                       (2U)
#define SDIO_STS_CMDRESTO_Msk                                       (0x1UL << SDIO_STS_CMDRESTO_Pos)                               /*!< 0x00000004 */
#define SDIO_STS_CMDRESTO                                           SDIO_STS_CMDRESTO_Msk                                          /*!<Command response timeout                      */
#define SDIO_STS_DATATO_Pos                                         (3U)
#define SDIO_STS_DATATO_Msk                                         (0x1UL << SDIO_STS_DATATO_Pos)                                 /*!< 0x00000008 */
#define SDIO_STS_DATATO                                             SDIO_STS_DATATO_Msk                                            /*!<Data timeout                                  */
#define SDIO_STS_TXUDRER_Pos                                        (4U)
#define SDIO_STS_TXUDRER_Msk                                        (0x1UL << SDIO_STS_TXUDRER_Pos)                                /*!< 0x00000010 */
#define SDIO_STS_TXUDRER                                            SDIO_STS_TXUDRER_Msk                                           /*!<Transmit FIFO underrun error                  */
#define SDIO_STS_RXOVRER_Pos                                        (5U)
#define SDIO_STS_RXOVRER_Msk                                        (0x1UL << SDIO_STS_RXOVRER_Pos)                                /*!< 0x00000020 */
#define SDIO_STS_RXOVRER                                            SDIO_STS_RXOVRER_Msk                                           /*!<Received FIFO overrun error                   */
#define SDIO_STS_CMDRES_Pos                                         (6U)
#define SDIO_STS_CMDRES_Msk                                         (0x1UL << SDIO_STS_CMDRES_Pos)                                 /*!< 0x00000040 */
#define SDIO_STS_CMDRES                                             SDIO_STS_CMDRES_Msk                                            /*!<Command response received (CRC check passed)  */
#define SDIO_STS_CMDSENT_Pos                                        (7U)
#define SDIO_STS_CMDSENT_Msk                                        (0x1UL << SDIO_STS_CMDSENT_Pos)                                /*!< 0x00000080 */
#define SDIO_STS_CMDSENT                                            SDIO_STS_CMDSENT_Msk                                           /*!<Command sent (no response required)           */
#define SDIO_STS_DATAEND_Pos                                        (8U)
#define SDIO_STS_DATAEND_Msk                                        (0x1UL << SDIO_STS_DATAEND_Pos)                                /*!< 0x00000100 */
#define SDIO_STS_DATAEND                                            SDIO_STS_DATAEND_Msk                                           /*!<Data end (data counter, SDIDCOUNT, is zero)   */
#define SDIO_STS_SBE_Pos                                            (9U)
#define SDIO_STS_SBE_Msk                                            (0x1UL << SDIO_STS_SBE_Pos)                                    /*!< 0x00000200 */
#define SDIO_STS_SBE                                                SDIO_STS_SBE_Msk                                               /*!<Start bit not detected on all data signals in wide bus mode */
#define SDIO_STS_DBCP_Pos                                           (10U)
#define SDIO_STS_DBCP_Msk                                           (0x1UL << SDIO_STS_DBCP_Pos)                                   /*!< 0x00000400 */
#define SDIO_STS_DBCP                                               SDIO_STS_DBCP_Msk                                              /*!<Data block sent/received (CRC check passed)   */
#define SDIO_STS_CMDACT_Pos                                         (11U)
#define SDIO_STS_CMDACT_Msk                                         (0x1UL << SDIO_STS_CMDACT_Pos)                                 /*!< 0x00000800 */
#define SDIO_STS_CMDACT                                             SDIO_STS_CMDACT_Msk                                            /*!<Command transfer in progress                  */
#define SDIO_STS_TXACT_Pos                                          (12U)
#define SDIO_STS_TXACT_Msk                                          (0x1UL << SDIO_STS_TXACT_Pos)                                  /*!< 0x00001000 */
#define SDIO_STS_TXACT                                              SDIO_STS_TXACT_Msk                                             /*!<Data transmit in progress                     */
#define SDIO_STS_RXACT_Pos                                          (13U)
#define SDIO_STS_RXACT_Msk                                          (0x1UL << SDIO_STS_RXACT_Pos)                                  /*!< 0x00002000 */
#define SDIO_STS_RXACT                                              SDIO_STS_RXACT_Msk                                             /*!<Data receive in progress                      */
#define SDIO_STS_TXFHF_Pos                                          (14U)
#define SDIO_STS_TXFHF_Msk                                          (0x1UL << SDIO_STS_TXFHF_Pos)                                  /*!< 0x00004000 */
#define SDIO_STS_TXFHF                                              SDIO_STS_TXFHF_Msk                                             /*!<Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
#define SDIO_STS_RXFHF_Pos                                          (15U)
#define SDIO_STS_RXFHF_Msk                                          (0x1UL << SDIO_STS_RXFHF_Pos)                                  /*!< 0x00008000 */
#define SDIO_STS_RXFHF                                              SDIO_STS_RXFHF_Msk                                             /*!<Receive FIFO Half Full: there are at least 8 words in the FIFO */
#define SDIO_STS_TXFF_Pos                                           (16U)
#define SDIO_STS_TXFF_Msk                                           (0x1UL << SDIO_STS_TXFF_Pos)                                   /*!< 0x00010000 */
#define SDIO_STS_TXFF                                               SDIO_STS_TXFF_Msk                                              /*!<Transmit FIFO full                            */
#define SDIO_STS_RXFF_Pos                                           (17U)
#define SDIO_STS_RXFF_Msk                                           (0x1UL << SDIO_STS_RXFF_Pos)                                   /*!< 0x00020000 */
#define SDIO_STS_RXFF                                               SDIO_STS_RXFF_Msk                                              /*!<Receive FIFO full                             */
#define SDIO_STS_TXFE_Pos                                           (18U)
#define SDIO_STS_TXFE_Msk                                           (0x1UL << SDIO_STS_TXFE_Pos)                                   /*!< 0x00040000 */
#define SDIO_STS_TXFE                                               SDIO_STS_TXFE_Msk                                              /*!<Transmit FIFO empty                           */
#define SDIO_STS_RXFE_Pos                                           (19U)
#define SDIO_STS_RXFE_Msk                                           (0x1UL << SDIO_STS_RXFE_Pos)                                   /*!< 0x00080000 */
#define SDIO_STS_RXFE                                               SDIO_STS_RXFE_Msk                                              /*!<Receive FIFO empty                            */
#define SDIO_STS_TXDA_Pos                                           (20U)
#define SDIO_STS_TXDA_Msk                                           (0x1UL << SDIO_STS_TXDA_Pos)                                   /*!< 0x00100000 */
#define SDIO_STS_TXDA                                               SDIO_STS_TXDA_Msk                                              /*!<Data available in transmit FIFO               */
#define SDIO_STS_RXDA_Pos                                           (21U)
#define SDIO_STS_RXDA_Msk                                           (0x1UL << SDIO_STS_RXDA_Pos)                                   /*!< 0x00200000 */
#define SDIO_STS_RXDA                                               SDIO_STS_RXDA_Msk                                              /*!<Data available in receive FIFO                */
#define SDIO_STS_SDIOINT_Pos                                        (22U)
#define SDIO_STS_SDIOINT_Msk                                        (0x1UL << SDIO_STS_SDIOINT_Pos)                                /*!< 0x00400000 */
#define SDIO_STS_SDIOINT                                            SDIO_STS_SDIOINT_Msk                                           /*!<SDIO interrupt received                       */
#define SDIO_STS_ATAEND_Pos                                         (23U)
#define SDIO_STS_ATAEND_Msk                                         (0x1UL << SDIO_STS_ATAEND_Pos)                                 /*!< 0x00800000 */
#define SDIO_STS_ATAEND                                             SDIO_STS_ATAEND_Msk                                            /*!<CE-ATA command completion signal received for CMD61 */

/*******************  Bit definition for SDIO_ICF register  *******************/
#define SDIO_ICF_CRCE_Pos                                           (0U)
#define SDIO_ICF_CRCE_Msk                                           (0x1UL << SDIO_ICF_CRCE_Pos)                                   /*!< 0x00000001 */
#define SDIO_ICF_CRCE                                               SDIO_ICF_CRCE_Msk                                              /*!<CCRCFAIL flag clear bit */
#define SDIO_ICF_DBCE_Pos                                           (1U)
#define SDIO_ICF_DBCE_Msk                                           (0x1UL << SDIO_ICF_DBCE_Pos)                                   /*!< 0x00000002 */
#define SDIO_ICF_DBCE                                               SDIO_ICF_DBCE_Msk                                              /*!<DCRCFAIL flag clear bit */
#define SDIO_ICF_CRTO_Pos                                           (2U)
#define SDIO_ICF_CRTO_Msk                                           (0x1UL << SDIO_ICF_CRTO_Pos)                                   /*!< 0x00000004 */
#define SDIO_ICF_CRTO                                               SDIO_ICF_CRTO_Msk                                              /*!<CTIMEOUT flag clear bit */
#define SDIO_ICF_DTO_Pos                                            (3U)
#define SDIO_ICF_DTO_Msk                                            (0x1UL << SDIO_ICF_DTO_Pos)                                    /*!< 0x00000008 */
#define SDIO_ICF_DTO                                                SDIO_ICF_DTO_Msk                                               /*!<DTIMEOUT flag clear bit */
#define SDIO_ICF_TXFUE_Pos                                          (4U)
#define SDIO_ICF_TXFUE_Msk                                          (0x1UL << SDIO_ICF_TXFUE_Pos)                                  /*!< 0x00000010 */
#define SDIO_ICF_TXFUE                                              SDIO_ICF_TXFUE_Msk                                             /*!<TXUNDERR flag clear bit */
#define SDIO_ICF_RXFOE_Pos                                          (5U)
#define SDIO_ICF_RXFOE_Msk                                          (0x1UL << SDIO_ICF_RXFOE_Pos)                                  /*!< 0x00000020 */
#define SDIO_ICF_RXFOE                                              SDIO_ICF_RXFOE_Msk                                             /*!<RXOVERR flag clear bit  */
#define SDIO_ICF_CMDRES_Pos                                         (6U)
#define SDIO_ICF_CMDRES_Msk                                         (0x1UL << SDIO_ICF_CMDRES_Pos)                                 /*!< 0x00000040 */
#define SDIO_ICF_CMDRES                                             SDIO_ICF_CMDRES_Msk                                            /*!<CMDREND flag clear bit  */
#define SDIO_ICF_CMDSENT_Pos                                        (7U)
#define SDIO_ICF_CMDSENT_Msk                                        (0x1UL << SDIO_ICF_CMDSENT_Pos)                                /*!< 0x00000080 */
#define SDIO_ICF_CMDSENT                                            SDIO_ICF_CMDSENT_Msk                                           /*!<CMDSENT flag clear bit  */
#define SDIO_ICF_DATAEND_Pos                                        (8U)
#define SDIO_ICF_DATAEND_Msk                                        (0x1UL << SDIO_ICF_DATAEND_Pos)                                /*!< 0x00000100 */
#define SDIO_ICF_DATAEND                                            SDIO_ICF_DATAEND_Msk                                           /*!<DATAEND flag clear bit  */
#define SDIO_ICF_SBE_Pos                                            (9U)
#define SDIO_ICF_SBE_Msk                                            (0x1UL << SDIO_ICF_SBE_Pos)                                    /*!< 0x00000200 */
#define SDIO_ICF_SBE                                                SDIO_ICF_SBE_Msk                                               /*!<STBITERR flag clear bit */
#define SDIO_ICF_DBCP_Pos                                           (10U)
#define SDIO_ICF_DBCP_Msk                                           (0x1UL << SDIO_ICF_DBCP_Pos)                                   /*!< 0x00000400 */
#define SDIO_ICF_DBCP                                               SDIO_ICF_DBCP_Msk                                              /*!<DBCKEND flag clear bit  */
#define SDIO_ICF_SDIOIT_Pos                                         (22U)
#define SDIO_ICF_SDIOIT_Msk                                         (0x1UL << SDIO_ICF_SDIOIT_Pos)                                 /*!< 0x00400000 */
#define SDIO_ICF_SDIOIT                                             SDIO_ICF_SDIOIT_Msk                                            /*!<SDIOIT flag clear bit   */
#define SDIO_ICF_ATAEND_Pos                                         (23U)
#define SDIO_ICF_ATAEND_Msk                                         (0x1UL << SDIO_ICF_ATAEND_Pos)                                 /*!< 0x00800000 */
#define SDIO_ICF_ATAEND                                             SDIO_ICF_ATAEND_Msk                                            /*!<CEATAEND flag clear bit */

