betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
#define USB_OTG_HPTXSTS_QTOP_Pos                                    (24U)
#define USB_OTG_HPTXSTS_QTOP_Msk                                    (0xFFUL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0xFF000000 */
#define USB_OTG_HPTXSTS_QTOP                                        USB_OTG_HPTXSTS_QTOP_Msk                                       /*!< Top of the periodic transmit request queue */
#define USB_OTG_HPTXSTS_QTOP_0                                      (0x01UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x01000000 */
#define USB_OTG_HPTXSTS_QTOP_1                                      (0x02UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x02000000 */
#define USB_OTG_HPTXSTS_QTOP_2                                      (0x04UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x04000000 */
#define USB_OTG_HPTXSTS_QTOP_3                                      (0x08UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x08000000 */
#define USB_OTG_HPTXSTS_QTOP_4                                      (0x10UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x10000000 */
#define USB_OTG_HPTXSTS_QTOP_5                                      (0x20UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x20000000 */
#define USB_OTG_HPTXSTS_QTOP_6                                      (0x40UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x40000000 */
#define USB_OTG_HPTXSTS_QTOP_7                                      (0x80UL << USB_OTG_HPTXSTS_QTOP_Pos)                           /*!< 0x80000000 */

/********************  Bit definition for USB_OTG_HACHINT register  ********************/
#define USB_OTG_HACHINT_ACHINT_Pos                                  (0U)
#define USB_OTG_HACHINT_ACHINT_Msk                                  (0xFFFFUL << USB_OTG_HACHINT_ACHINT_Pos)                       /*!< 0x0000FFFF */
#define USB_OTG_HACHINT_ACHINT                                      USB_OTG_HACHINT_ACHINT_Msk                                     /*!< Channel interrupts */

/********************  Bit definition for USB_OTG_DOUTIMASK register  ********************/
#define USB_OTG_DOUTIMASK_TSFCMPM_Pos                               (0U)
#define USB_OTG_DOUTIMASK_TSFCMPM_Msk                               (0x1UL << USB_OTG_DOUTIMASK_TSFCMPM_Pos)                       /*!< 0x00000001 */
#define USB_OTG_DOUTIMASK_TSFCMPM                                   USB_OTG_DOUTIMASK_TSFCMPM_Msk                                  /*!< Transfer completed interrupt mask              */
#define USB_OTG_DOUTIMASK_EPDISM_Pos                                (1U)
#define USB_OTG_DOUTIMASK_EPDISM_Msk                                (0x1UL << USB_OTG_DOUTIMASK_EPDISM_Pos)                        /*!< 0x00000002 */
#define USB_OTG_DOUTIMASK_EPDISM                                    USB_OTG_DOUTIMASK_EPDISM_Msk                                   /*!< Endpoint disabled interrupt mask               */
#define USB_OTG_DOUTIMASK_AHBERRIM_Pos                              (2U)
#define USB_OTG_DOUTIMASK_AHBERRIM_Msk                              (0x1UL << USB_OTG_DOUTIMASK_AHBERRIM_Pos)                      /*!< 0x00000004 */
#define USB_OTG_DOUTIMASK_AHBERRIM                                  USB_OTG_DOUTIMASK_AHBERRIM_Msk                                 /*!< OUT transaction AHB Error interrupt mask       */
#define USB_OTG_DOUTIMASK_SETPCMPM_Pos                              (3U)
#define USB_OTG_DOUTIMASK_SETPCMPM_Msk                              (0x1UL << USB_OTG_DOUTIMASK_SETPCMPM_Pos)                      /*!< 0x00000008 */
#define USB_OTG_DOUTIMASK_SETPCMPM                                  USB_OTG_DOUTIMASK_SETPCMPM_Msk                                 /*!< SETUP phase done mask                          */
#define USB_OTG_DOUTIMASK_OTXEMPM_Pos                               (4U)
#define USB_OTG_DOUTIMASK_OTXEMPM_Msk                               (0x1UL << USB_OTG_DOUTIMASK_OTXEMPM_Pos)                       /*!< 0x00000010 */
#define USB_OTG_DOUTIMASK_OTXEMPM                                   USB_OTG_DOUTIMASK_OTXEMPM_Msk                                  /*!< OUT token received when endpoint disabled mask */
#define USB_OTG_DOUTIMASK_OTEPSPRM_Pos                              (5U)
#define USB_OTG_DOUTIMASK_OTEPSPRM_Msk                              (0x1UL << USB_OTG_DOUTIMASK_OTEPSPRM_Pos)                      /*!< 0x00000020 */
#define USB_OTG_DOUTIMASK_OTEPSPRM                                  USB_OTG_DOUTIMASK_OTEPSPRM_Msk                                 /*!< Status Phase Received mask                     */
#define USB_OTG_DOUTIMASK_BTBSETM_Pos                               (6U)
#define USB_OTG_DOUTIMASK_BTBSETM_Msk                               (0x1UL << USB_OTG_DOUTIMASK_BTBSETM_Pos)                       /*!< 0x00000040 */
#define USB_OTG_DOUTIMASK_BTBSETM                                   USB_OTG_DOUTIMASK_BTBSETM_Msk                                  /*!< Back-to-back SETUP packets received mask       */
#define USB_OTG_DOUTIMASK_OPCKTERRM_Pos                             (8U)
#define USB_OTG_DOUTIMASK_OPCKTERRM_Msk                             (0x1UL << USB_OTG_DOUTIMASK_OPCKTERRM_Pos)                     /*!< 0x00000100 */
#define USB_OTG_DOUTIMASK_OPCKTERRM                                 USB_OTG_DOUTIMASK_OPCKTERRM_Msk                                /*!< OUT packet error mask                          */
#define USB_OTG_DOUTIMASK_BNAM_Pos                                  (9U)
#define USB_OTG_DOUTIMASK_BNAM_Msk                                  (0x1UL << USB_OTG_DOUTIMASK_BNAM_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DOUTIMASK_BNAM                                      USB_OTG_DOUTIMASK_BNAM_Msk                                     /*!< BNA interrupt mask                             */
#define USB_OTG_DOUTIMASK_BERRM_Pos                                 (12U)
#define USB_OTG_DOUTIMASK_BERRM_Msk                                 (0x1UL << USB_OTG_DOUTIMASK_BERRM_Pos)                         /*!< 0x00001000 */
#define USB_OTG_DOUTIMASK_BERRM                                     USB_OTG_DOUTIMASK_BERRM_Msk                                    /*!< Babble error interrupt mask                   */
#define USB_OTG_DOUTIMASK_NAKM_Pos                                  (13U)
#define USB_OTG_DOUTIMASK_NAKM_Msk                                  (0x1UL << USB_OTG_DOUTIMASK_NAKM_Pos)                          /*!< 0x00002000 */
#define USB_OTG_DOUTIMASK_NAKM                                      USB_OTG_DOUTIMASK_NAKM_Msk                                     /*!< OUT Packet NAK interrupt mask                  */
#define USB_OTG_DOUTIMASK_NYETM_Pos                                 (14U)
#define USB_OTG_DOUTIMASK_NYETM_Msk                                 (0x1UL << USB_OTG_DOUTIMASK_NYETM_Pos)                         /*!< 0x00004000 */
#define USB_OTG_DOUTIMASK_NYETM                                     USB_OTG_DOUTIMASK_NYETM_Msk                                    /*!< NYET interrupt mask                            */
/********************  Bit definition for USB_OTG_GCINT register  ********************/
#define USB_OTG_GCINT_CURMOSEL_Pos                                  (0U)
#define USB_OTG_GCINT_CURMOSEL_Msk                                  (0x1UL << USB_OTG_GCINT_CURMOSEL_Pos)                          /*!< 0x00000001 */
#define USB_OTG_GCINT_CURMOSEL                                      USB_OTG_GCINT_CURMOSEL_Msk                                     /*!< Current mode of operation                      */
#define USB_OTG_GCINT_MMIS_Pos                                      (1U)
#define USB_OTG_GCINT_MMIS_Msk                                      (0x1UL << USB_OTG_GCINT_MMIS_Pos)                              /*!< 0x00000002 */
#define USB_OTG_GCINT_MMIS                                          USB_OTG_GCINT_MMIS_Msk                                         /*!< Mode mismatch interrupt                        */
#define USB_OTG_GCINT_OTG_Pos                                       (2U)
#define USB_OTG_GCINT_OTG_Msk                                       (0x1UL << USB_OTG_GCINT_OTG_Pos)                               /*!< 0x00000004 */
#define USB_OTG_GCINT_OTG                                           USB_OTG_GCINT_OTG_Msk                                          /*!< OTG interrupt                                  */
#define USB_OTG_GCINT_SOF_Pos                                       (3U)
#define USB_OTG_GCINT_SOF_Msk                                       (0x1UL << USB_OTG_GCINT_SOF_Pos)                               /*!< 0x00000008 */
#define USB_OTG_GCINT_SOF                                           USB_OTG_GCINT_SOF_Msk                                          /*!< Start of frame                                 */
#define USB_OTG_GCINT_RXFNONE_Pos                                   (4U)
#define USB_OTG_GCINT_RXFNONE_Msk                                   (0x1UL << USB_OTG_GCINT_RXFNONE_Pos)                           /*!< 0x00000010 */
#define USB_OTG_GCINT_RXFNONE                                       USB_OTG_GCINT_RXFNONE_Msk                                      /*!< RxFIFO nonempty                                */
#define USB_OTG_GCINT_NPTXFEM_Pos                                   (5U)
#define USB_OTG_GCINT_NPTXFEM_Msk                                   (0x1UL << USB_OTG_GCINT_NPTXFEM_Pos)                           /*!< 0x00000020 */
#define USB_OTG_GCINT_NPTXFEM                                       USB_OTG_GCINT_NPTXFEM_Msk                                      /*!< Nonperiodic TxFIFO empty                       */
#define USB_OTG_GCINT_GINNPNAKE_Pos                                 (6U)
#define USB_OTG_GCINT_GINNPNAKE_Msk                                 (0x1UL << USB_OTG_GCINT_GINNPNAKE_Pos)                         /*!< 0x00000040 */
#define USB_OTG_GCINT_GINNPNAKE                                     USB_OTG_GCINT_GINNPNAKE_Msk                                    /*!< Global IN nonperiodic NAK effective            */
#define USB_OTG_GCINT_GONAKE_Pos                                    (7U)
#define USB_OTG_GCINT_GONAKE_Msk                                    (0x1UL << USB_OTG_GCINT_GONAKE_Pos)                            /*!< 0x00000080 */
#define USB_OTG_GCINT_GONAKE                                        USB_OTG_GCINT_GONAKE_Msk                                       /*!< Global OUT NAK effective                       */
#define USB_OTG_GCINT_ESUS_Pos                                      (10U)
#define USB_OTG_GCINT_ESUS_Msk                                      (0x1UL << USB_OTG_GCINT_ESUS_Pos)                              /*!< 0x00000400 */
#define USB_OTG_GCINT_ESUS                                          USB_OTG_GCINT_ESUS_Msk                                         /*!< Early suspend                                  */
#define USB_OTG_GCINT_USBSUS_Pos                                    (11U)
#define USB_OTG_GCINT_USBSUS_Msk                                    (0x1UL << USB_OTG_GCINT_USBSUS_Pos)                            /*!< 0x00000800 */
#define USB_OTG_GCINT_USBSUS                                        USB_OTG_GCINT_USBSUS_Msk                                       /*!< USB suspend                                    */
#define USB_OTG_GCINT_USBRST_Pos                                    (12U)
#define USB_OTG_GCINT_USBRST_Msk                                    (0x1UL << USB_OTG_GCINT_USBRST_Pos)                            /*!< 0x00001000 */
#define USB_OTG_GCINT_USBRST                                        USB_OTG_GCINT_USBRST_Msk                                       /*!< USB reset                                      */
#define USB_OTG_GCINT_ENUMD_Pos                                     (13U)
#define USB_OTG_GCINT_ENUMD_Msk                                     (0x1UL << USB_OTG_GCINT_ENUMD_Pos)                             /*!< 0x00002000 */
#define USB_OTG_GCINT_ENUMD                                         USB_OTG_GCINT_ENUMD_Msk                                        /*!< Enumeration done                               */
#define USB_OTG_GCINT_ISOPD_Pos                                     (14U)
#define USB_OTG_GCINT_ISOPD_Msk                                     (0x1UL << USB_OTG_GCINT_ISOPD_Pos)                             /*!< 0x00004000 */
#define USB_OTG_GCINT_ISOPD                                         USB_OTG_GCINT_ISOPD_Msk                                        /*!< Isochronous OUT packet dropped interrupt       */
#define USB_OTG_GCINT_EOPF_Pos                                      (15U)
#define USB_OTG_GCINT_EOPF_Msk                                      (0x1UL << USB_OTG_GCINT_EOPF_Pos)                              /*!< 0x00008000 */
#define USB_OTG_GCINT_EOPF                                          USB_OTG_GCINT_EOPF_Msk                                         /*!< End of periodic frame interrupt                */
#define USB_OTG_GCINT_INEP_Pos                                      (18U)
#define USB_OTG_GCINT_INEP_Msk                                      (0x1UL << USB_OTG_GCINT_INEP_Pos)                              /*!< 0x00040000 */
#define USB_OTG_GCINT_INEP                                          USB_OTG_GCINT_INEP_Msk                                         /*!< IN endpoint interrupt                          */
#define USB_OTG_GCINT_ONEP_Pos                                      (19U)
#define USB_OTG_GCINT_ONEP_Msk                                      (0x1UL << USB_OTG_GCINT_ONEP_Pos)                              /*!< 0x00080000 */
#define USB_OTG_GCINT_ONEP                                          USB_OTG_GCINT_ONEP_Msk                                         /*!< OUT endpoint interrupt                         */
#define USB_OTG_GCINT_IIINTX_Pos                                    (20U)
#define USB_OTG_GCINT_IIINTX_Msk                                    (0x1UL << USB_OTG_GCINT_IIINTX_Pos)                            /*!< 0x00100000 */
#define USB_OTG_GCINT_IIINTX                                        USB_OTG_GCINT_IIINTX_Msk                                       /*!< Incomplete isochronous IN transfer             */
#define USB_OTG_GCINT_IP_OUTTX_Pos                                  (21U)
#define USB_OTG_GCINT_IP_OUTTX_Msk                                  (0x1UL << USB_OTG_GCINT_IP_OUTTX_Pos)                          /*!< 0x00200000 */
#define USB_OTG_GCINT_IP_OUTTX                                      USB_OTG_GCINT_IP_OUTTX_Msk                                     /*!< Incomplete periodic transfer                   */
#define USB_OTG_GCINT_DFSUS_Pos                                     (22U)
#define USB_OTG_GCINT_DFSUS_Msk                                     (0x1UL << USB_OTG_GCINT_DFSUS_Pos)                             /*!< 0x00400000 */
#define USB_OTG_GCINT_DFSUS                                         USB_OTG_GCINT_DFSUS_Msk                                        /*!< Data fetch suspended                           */
#define USB_OTG_GCINT_HPORT_Pos                                     (24U)
#define USB_OTG_GCINT_HPORT_Msk                                     (0x1UL << USB_OTG_GCINT_HPORT_Pos)                             /*!< 0x01000000 */
#define USB_OTG_GCINT_HPORT                                         USB_OTG_GCINT_HPORT_Msk                                        /*!< Host port interrupt                            */
#define USB_OTG_GCINT_HCHAN_Pos                                     (25U)
#define USB_OTG_GCINT_HCHAN_Msk                                     (0x1UL << USB_OTG_GCINT_HCHAN_Pos)                             /*!< 0x02000000 */
#define USB_OTG_GCINT_HCHAN                                         USB_OTG_GCINT_HCHAN_Msk                                        /*!< Host channels interrupt                        */
#define USB_OTG_GCINT_PTXFE_Pos                                     (26U)
#define USB_OTG_GCINT_PTXFE_Msk                                     (0x1UL << USB_OTG_GCINT_PTXFE_Pos)                             /*!< 0x04000000 */
#define USB_OTG_GCINT_PTXFE                                         USB_OTG_GCINT_PTXFE_Msk                                        /*!< Periodic TxFIFO empty                          */
#define USB_OTG_GCINT_CINSTSC_Pos                                   (28U)
#define USB_OTG_GCINT_CINSTSC_Msk                                   (0x1UL << USB_OTG_GCINT_CINSTSC_Pos)                           /*!< 0x10000000 */
#define USB_OTG_GCINT_CINSTSC                                       USB_OTG_GCINT_CINSTSC_Msk                                      /*!< Connector ID status change                     */
#define USB_OTG_GCINT_DEDIS_Pos                                     (29U)
#define USB_OTG_GCINT_DEDIS_Msk                                     (0x1UL << USB_OTG_GCINT_DEDIS_Pos)                             /*!< 0x20000000 */
#define USB_OTG_GCINT_DEDIS                                         USB_OTG_GCINT_DEDIS_Msk                                        /*!< Disconnect detected interrupt                  */
#define USB_OTG_GCINT_SREQ_Pos                                      (30U)
#define USB_OTG_GCINT_SREQ_Msk                                      (0x1UL << USB_OTG_GCINT_SREQ_Pos)                              /*!< 0x40000000 */
#define USB_OTG_GCINT_SREQ                                          USB_OTG_GCINT_SREQ_Msk                                         /*!< Session request/new session detected interrupt */
#define USB_OTG_GCINT_RWAKE_Pos                                     (31U)
#define USB_OTG_GCINT_RWAKE_Msk                                     (0x1UL << USB_OTG_GCINT_RWAKE_Pos)                             /*!< 0x80000000 */
#define USB_OTG_GCINT_RWAKE                                         USB_OTG_GCINT_RWAKE_Msk                                        /*!< Resume/remote wakeup detected interrupt        */

