betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f405xx.h
/********************  Bit definition for USB_OTG_HCHINT register  ********************/
#define USB_OTG_HCHINT_TSFCMPN_Pos                                  (0U)
#define USB_OTG_HCHINT_TSFCMPN_Msk                                  (0x1UL << USB_OTG_HCHINT_TSFCMPN_Pos)                          /*!< 0x00000001 */
#define USB_OTG_HCHINT_TSFCMPN                                      USB_OTG_HCHINT_TSFCMPN_Msk                                     /*!< Transfer completed */
#define USB_OTG_HCHINT_TSFCMPAN_Pos                                 (1U)
#define USB_OTG_HCHINT_TSFCMPAN_Msk                                 (0x1UL << USB_OTG_HCHINT_TSFCMPAN_Pos)                         /*!< 0x00000002 */
#define USB_OTG_HCHINT_TSFCMPAN                                     USB_OTG_HCHINT_TSFCMPAN_Msk                                    /*!< Channel halted */
#define USB_OTG_HCHINT_AHBERR_Pos                                   (2U)
#define USB_OTG_HCHINT_AHBERR_Msk                                   (0x1UL << USB_OTG_HCHINT_AHBERR_Pos)                           /*!< 0x00000004 */
#define USB_OTG_HCHINT_AHBERR                                       USB_OTG_HCHINT_AHBERR_Msk                                      /*!< AHB error */
#define USB_OTG_HCHINT_RXSTALL_Pos                                  (3U)
#define USB_OTG_HCHINT_RXSTALL_Msk                                  (0x1UL << USB_OTG_HCHINT_RXSTALL_Pos)                          /*!< 0x00000008 */
#define USB_OTG_HCHINT_RXSTALL                                      USB_OTG_HCHINT_RXSTALL_Msk                                     /*!< STALL response received interrupt */
#define USB_OTG_HCHINT_RXNAK_Pos                                    (4U)
#define USB_OTG_HCHINT_RXNAK_Msk                                    (0x1UL << USB_OTG_HCHINT_RXNAK_Pos)                            /*!< 0x00000010 */
#define USB_OTG_HCHINT_RXNAK                                        USB_OTG_HCHINT_RXNAK_Msk                                       /*!< NAK response received interrupt */
#define USB_OTG_HCHINT_RXTXACK_Pos                                  (5U)
#define USB_OTG_HCHINT_RXTXACK_Msk                                  (0x1UL << USB_OTG_HCHINT_RXTXACK_Pos)                          /*!< 0x00000020 */
#define USB_OTG_HCHINT_RXTXACK                                      USB_OTG_HCHINT_RXTXACK_Msk                                     /*!< ACK response received/transmitted interrupt */
#define USB_OTG_HCHINT_RXNYET_Pos                                   (6U)
#define USB_OTG_HCHINT_RXNYET_Msk                                   (0x1UL << USB_OTG_HCHINT_RXNYET_Pos)                           /*!< 0x00000040 */
#define USB_OTG_HCHINT_RXNYET                                       USB_OTG_HCHINT_RXNYET_Msk                                      /*!< Response received interrupt */
#define USB_OTG_HCHINT_TERR_Pos                                     (7U)
#define USB_OTG_HCHINT_TERR_Msk                                     (0x1UL << USB_OTG_HCHINT_TERR_Pos)                             /*!< 0x00000080 */
#define USB_OTG_HCHINT_TERR                                         USB_OTG_HCHINT_TERR_Msk                                        /*!< Transaction error */
#define USB_OTG_HCHINT_BABBLE_Pos                                   (8U)
#define USB_OTG_HCHINT_BABBLE_Msk                                   (0x1UL << USB_OTG_HCHINT_BABBLE_Pos)                           /*!< 0x00000100 */
#define USB_OTG_HCHINT_BABBLE                                       USB_OTG_HCHINT_BABBLE_Msk                                      /*!< Babble error */
#define USB_OTG_HCHINT_FOVR_Pos                                     (9U)
#define USB_OTG_HCHINT_FOVR_Msk                                     (0x1UL << USB_OTG_HCHINT_FOVR_Pos)                             /*!< 0x00000200 */
#define USB_OTG_HCHINT_FOVR                                         USB_OTG_HCHINT_FOVR_Msk                                        /*!< Frame overrun */
#define USB_OTG_HCHINT_DTOG_Pos                                     (10U)
#define USB_OTG_HCHINT_DTOG_Msk                                     (0x1UL << USB_OTG_HCHINT_DTOG_Pos)                             /*!< 0x00000400 */
#define USB_OTG_HCHINT_DTOG                                         USB_OTG_HCHINT_DTOG_Msk                                        /*!< Data toggle error */

/********************  Bit definition for USB_OTG_DIEPINT register  ********************/
#define USB_OTG_DIEPINT_TSFCMP_Pos                                  (0U)
#define USB_OTG_DIEPINT_TSFCMP_Msk                                  (0x1UL << USB_OTG_DIEPINT_TSFCMP_Pos)                          /*!< 0x00000001 */
#define USB_OTG_DIEPINT_TSFCMP                                      USB_OTG_DIEPINT_TSFCMP_Msk                                     /*!< Transfer completed interrupt */
#define USB_OTG_DIEPINT_EPDIS_Pos                                   (1U)
#define USB_OTG_DIEPINT_EPDIS_Msk                                   (0x1UL << USB_OTG_DIEPINT_EPDIS_Pos)                           /*!< 0x00000002 */
#define USB_OTG_DIEPINT_EPDIS                                       USB_OTG_DIEPINT_EPDIS_Msk                                      /*!< Endpoint disabled interrupt */
#define USB_OTG_DIEPINT_AHBERR_Pos                                  (2U)
#define USB_OTG_DIEPINT_AHBERR_Msk                                  (0x1UL << USB_OTG_DIEPINT_AHBERR_Pos)                          /*!< 0x00000004 */
#define USB_OTG_DIEPINT_AHBERR                                      USB_OTG_DIEPINT_AHBERR_Msk                                     /*!< AHB Error (AHBErr) during an IN transaction */
#define USB_OTG_DIEPINT_TO_Pos                                      (3U)
#define USB_OTG_DIEPINT_TO_Msk                                      (0x1UL << USB_OTG_DIEPINT_TO_Pos)                              /*!< 0x00000008 */
#define USB_OTG_DIEPINT_TO                                          USB_OTG_DIEPINT_TO_Msk                                         /*!< Timeout condition */
#define USB_OTG_DIEPINT_ITXEMP_Pos                                  (4U)
#define USB_OTG_DIEPINT_ITXEMP_Msk                                  (0x1UL << USB_OTG_DIEPINT_ITXEMP_Pos)                          /*!< 0x00000010 */
#define USB_OTG_DIEPINT_ITXEMP                                      USB_OTG_DIEPINT_ITXEMP_Msk                                     /*!< IN token received when TxFIFO is empty */
#define USB_OTG_DIEPINT_IEPMM_Pos                                   (5U)
#define USB_OTG_DIEPINT_IEPMM_Msk                                   (0x1UL << USB_OTG_DIEPINT_IEPMM_Pos)                           /*!< 0x00000004 */
#define USB_OTG_DIEPINT_IEPMM                                       USB_OTG_DIEPINT_IEPMM_Msk                                      /*!< IN token received with EP mismatch */
#define USB_OTG_DIEPINT_IEPNAKE_Pos                                 (6U)
#define USB_OTG_DIEPINT_IEPNAKE_Msk                                 (0x1UL << USB_OTG_DIEPINT_IEPNAKE_Pos)                         /*!< 0x00000040 */
#define USB_OTG_DIEPINT_IEPNAKE                                     USB_OTG_DIEPINT_IEPNAKE_Msk                                    /*!< IN endpoint NAK effective */
#define USB_OTG_DIEPINT_TXFE_Pos                                    (7U)
#define USB_OTG_DIEPINT_TXFE_Msk                                    (0x1UL << USB_OTG_DIEPINT_TXFE_Pos)                            /*!< 0x00000080 */
#define USB_OTG_DIEPINT_TXFE                                        USB_OTG_DIEPINT_TXFE_Msk                                       /*!< Transmit FIFO empty */
#define USB_OTG_DIEPINT_TXFUDR_Pos                                  (8U)
#define USB_OTG_DIEPINT_TXFUDR_Msk                                  (0x1UL << USB_OTG_DIEPINT_TXFUDR_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DIEPINT_TXFUDR                                      USB_OTG_DIEPINT_TXFUDR_Msk                                     /*!< Transmit Fifo Underrun */
#define USB_OTG_DIEPINT_BUFFNA_Pos                                  (9U)
#define USB_OTG_DIEPINT_BUFFNA_Msk                                  (0x1UL << USB_OTG_DIEPINT_BUFFNA_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DIEPINT_BUFFNA                                      USB_OTG_DIEPINT_BUFFNA_Msk                                     /*!< Buffer not available interrupt */
#define USB_OTG_DIEPINT_PDROFLG_Pos                                 (11U)
#define USB_OTG_DIEPINT_PDROFLG_Msk                                 (0x1UL << USB_OTG_DIEPINT_PDROFLG_Pos)                         /*!< 0x00000800 */
#define USB_OTG_DIEPINT_PDROFLG                                     USB_OTG_DIEPINT_PDROFLG_Msk                                    /*!< Packet dropped status */
#define USB_OTG_DIEPINT_BERR_Pos                                    (12U)
#define USB_OTG_DIEPINT_BERR_Msk                                    (0x1UL << USB_OTG_DIEPINT_BERR_Pos)                            /*!< 0x00001000 */
#define USB_OTG_DIEPINT_BERR                                        USB_OTG_DIEPINT_BERR_Msk                                       /*!< Babble error interrupt */
#define USB_OTG_DIEPINT_NAK_Pos                                     (13U)
#define USB_OTG_DIEPINT_NAK_Msk                                     (0x1UL << USB_OTG_DIEPINT_NAK_Pos)                             /*!< 0x00002000 */
#define USB_OTG_DIEPINT_NAK                                         USB_OTG_DIEPINT_NAK_Msk                                        /*!< NAK interrupt */

/********************  Bit definition forUSB_OTG_HCHIMASK register  ********************/
#define USB_OTG_HCHIMASK_TSFCMPNM_Pos                               (0U)
#define USB_OTG_HCHIMASK_TSFCMPNM_Msk                               (0x1UL << USB_OTG_HCHIMASK_TSFCMPNM_Pos)                       /*!< 0x00000001 */
#define USB_OTG_HCHIMASK_TSFCMPNM                                   USB_OTG_HCHIMASK_TSFCMPNM_Msk                                  /*!< Transfer completed mask */
#define USB_OTG_HCHIMASK_TSFCMPANM_Pos                              (1U)
#define USB_OTG_HCHIMASK_TSFCMPANM_Msk                              (0x1UL << USB_OTG_HCHIMASK_TSFCMPANM_Pos)                      /*!< 0x00000002 */
#define USB_OTG_HCHIMASK_TSFCMPANM                                  USB_OTG_HCHIMASK_TSFCMPANM_Msk                                 /*!< Channel halted mask */
#define USB_OTG_HCHIMASK_AHBERRM_Pos                                (2U)
#define USB_OTG_HCHIMASK_AHBERRM_Msk                                (0x1UL << USB_OTG_HCHIMASK_AHBERRM_Pos)                        /*!< 0x00000004 */
#define USB_OTG_HCHIMASK_AHBERRM                                    USB_OTG_HCHIMASK_AHBERRM_Msk                                   /*!< AHB error */
#define USB_OTG_HCHIMASK_RXSTALLM_Pos                               (3U)
#define USB_OTG_HCHIMASK_RXSTALLM_Msk                               (0x1UL << USB_OTG_HCHIMASK_RXSTALLM_Pos)                       /*!< 0x00000008 */
#define USB_OTG_HCHIMASK_RXSTALLM                                   USB_OTG_HCHIMASK_RXSTALLM_Msk                                  /*!< STALL response received interrupt mask */
#define USB_OTG_HCHIMASK_RXNAKM_Pos                                 (4U)
#define USB_OTG_HCHIMASK_RXNAKM_Msk                                 (0x1UL << USB_OTG_HCHIMASK_RXNAKM_Pos)                         /*!< 0x00000010 */
#define USB_OTG_HCHIMASK_RXNAKM                                     USB_OTG_HCHIMASK_RXNAKM_Msk                                    /*!< NAK response received interrupt mask */
#define USB_OTG_HCHIMASK_RXTXACKM_Pos                               (5U)
#define USB_OTG_HCHIMASK_RXTXACKM_Msk                               (0x1UL << USB_OTG_HCHIMASK_RXTXACKM_Pos)                       /*!< 0x00000020 */
#define USB_OTG_HCHIMASK_RXTXACKM                                   USB_OTG_HCHIMASK_RXTXACKM_Msk                                  /*!< ACK response received/transmitted interrupt mask */
#define USB_OTG_HCHIMASK_RXNYETM_Pos                                (6U)
#define USB_OTG_HCHIMASK_RXNYETM_Msk                                (0x1UL << USB_OTG_HCHIMASK_RXNYETM_Pos)                        /*!< 0x00000040 */
#define USB_OTG_HCHIMASK_RXNYETM                                    USB_OTG_HCHIMASK_RXNYETM_Msk                                   /*!< response received interrupt mask */
#define USB_OTG_HCHIMASK_TERRM_Pos                                  (7U)
#define USB_OTG_HCHIMASK_TERRM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_TERRM_Pos)                          /*!< 0x00000080 */
#define USB_OTG_HCHIMASK_TERRM                                      USB_OTG_HCHIMASK_TERRM_Msk                                     /*!< Transaction error mask */
#define USB_OTG_HCHIMASK_BABBLEM_Pos                                (8U)
#define USB_OTG_HCHIMASK_BABBLEM_Msk                                (0x1UL << USB_OTG_HCHIMASK_BABBLEM_Pos)                        /*!< 0x00000100 */
#define USB_OTG_HCHIMASK_BABBLEM                                    USB_OTG_HCHIMASK_BABBLEM_Msk                                   /*!< Babble error mask */
#define USB_OTG_HCHIMASK_FOVRM_Pos                                  (9U)
#define USB_OTG_HCHIMASK_FOVRM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_FOVRM_Pos)                          /*!< 0x00000200 */
#define USB_OTG_HCHIMASK_FOVRM                                      USB_OTG_HCHIMASK_FOVRM_Msk                                     /*!< Frame overrun mask */
#define USB_OTG_HCHIMASK_DTOGM_Pos                                  (10U)
#define USB_OTG_HCHIMASK_DTOGM_Msk                                  (0x1UL << USB_OTG_HCHIMASK_DTOGM_Pos)                          /*!< 0x00000400 */
#define USB_OTG_HCHIMASK_DTOGM                                      USB_OTG_HCHIMASK_DTOGM_Msk                                     /*!< Data toggle error mask */

/********************  Bit definition for USB_OTG_DIEPTRS register  ********************/

#define USB_OTG_DIEPTRS_EPTRS_Pos                                   (0U)
#define USB_OTG_DIEPTRS_EPTRS_Msk                                   (0x7FFFFUL << USB_OTG_DIEPTRS_EPTRS_Pos)                       /*!< 0x0007FFFF */
#define USB_OTG_DIEPTRS_EPTRS                                       USB_OTG_DIEPTRS_EPTRS_Msk                                      /*!< Transfer size */
#define USB_OTG_DIEPTRS_EPPCNT_Pos                                  (19U)
#define USB_OTG_DIEPTRS_EPPCNT_Msk                                  (0x3FFUL << USB_OTG_DIEPTRS_EPPCNT_Pos)                        /*!< 0x1FF80000 */
#define USB_OTG_DIEPTRS_EPPCNT                                      USB_OTG_DIEPTRS_EPPCNT_Msk                                     /*!< Packet count */
#define USB_OTG_DIEPTRS_TXDSEL_Pos                                  (29U)
#define USB_OTG_DIEPTRS_TXDSEL_Msk                                  (0x3UL << USB_OTG_DIEPTRS_TXDSEL_Pos)                          /*!< 0x60000000 */
#define USB_OTG_DIEPTRS_TXDSEL                                      USB_OTG_DIEPTRS_TXDSEL_Msk                                     /*!< Packet count */
/********************  Bit definition for USB_OTG_HCHTSIZE register  ********************/
#define USB_OTG_HCHTSIZE_TSFSIZE_Pos                                (0U)
#define USB_OTG_HCHTSIZE_TSFSIZE_Msk                                (0x7FFFFUL << USB_OTG_HCHTSIZE_TSFSIZE_Pos)                    /*!< 0x0007FFFF */
#define USB_OTG_HCHTSIZE_TSFSIZE                                    USB_OTG_HCHTSIZE_TSFSIZE_Msk                                   /*!< Transfer size */
#define USB_OTG_HCHTSIZE_PCKTCNT_Pos                                (19U)
#define USB_OTG_HCHTSIZE_PCKTCNT_Msk                                (0x3FFUL << USB_OTG_HCHTSIZE_PCKTCNT_Pos)                      /*!< 0x1FF80000 */
#define USB_OTG_HCHTSIZE_PCKTCNT                                    USB_OTG_HCHTSIZE_PCKTCNT_Msk                                   /*!< Packet count */
#define USB_OTG_HCHTSIZE_DO_PING_Pos                                (31U)
#define USB_OTG_HCHTSIZE_DO_PING_Msk                                (0x1UL << USB_OTG_HCHTSIZE_DO_PING_Pos)                        /*!< 0x80000000 */
#define USB_OTG_HCHTSIZE_DO_PING                                    USB_OTG_HCHTSIZE_DO_PING_Msk                                   /*!< Do PING */
#define USB_OTG_HCHTSIZE_DATAPID_Pos                                (29U)
#define USB_OTG_HCHTSIZE_DATAPID_Msk                                (0x3UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x60000000 */
#define USB_OTG_HCHTSIZE_DATAPID                                    USB_OTG_HCHTSIZE_DATAPID_Msk                                   /*!< Data PID */
#define USB_OTG_HCHTSIZE_DATAPID_0                                  (0x1UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x20000000 */
#define USB_OTG_HCHTSIZE_DATAPID_1                                  (0x2UL << USB_OTG_HCHTSIZE_DATAPID_Pos)                        /*!< 0x40000000 */

/********************  Bit definition for USB_OTG_DIEPDMA register  ********************/
#define USB_OTG_DIEPDMA_DMAADDR_Pos                                 (0U)
#define USB_OTG_DIEPDMA_DMAADDR_Msk                                 (0xFFFFFFFFUL << USB_OTG_DIEPDMA_DMAADDR_Pos)                  /*!< 0xFFFFFFFF */
#define USB_OTG_DIEPDMA_DMAADDR                                     USB_OTG_DIEPDMA_DMAADDR_Msk                                    /*!< DMA address */

